lyusupov/SoftRF/software/firmware/source/SoftRF/src/platform/nRF52.cpp
/*
 * Platform_nRF52.cpp
 * Copyright (C) 2020-2026 Linar Yusupov
 *
 * This program is free software: you can redistribute it and/or modify
 * it under the terms of the GNU General Public License as published by
 * the Free Software Foundation, either version 3 of the License, or
 * (at your option) any later version.
 *
 * This program is distributed in the hope that it will be useful,
 * but WITHOUT ANY WARRANTY; without even the implied warranty of
 * MERCHANTABILITY or FITNESS FOR A PARTICULAR PURPOSE.  See the
 * GNU General Public License for more details.
 *
 * You should have received a copy of the GNU General Public License
 * along with this program.  If not, see <http://www.gnu.org/licenses/>.
 */

#if defined(ARDUINO_ARCH_NRF52)  || defined(ARDUINO_ARCH_NRF52840) || \
   (defined(ARDUINO_ARCH_ZEPHYR) && defined(NRF52840_XXAA))

#include <SPI.h>
#include <Wire.h>
#if !defined(ARDUINO_ARCH_MBED) && !defined(ARDUINO_ARCH_ZEPHYR)
#include <pcf8563.h>
//#include <RTC_RX8900_U.h>
#include <Adafruit_SPIFlash.h>
#include "Adafruit_TinyUSB.h"
#include <Adafruit_SleepyDog.h>
#endif /* ARDUINO_ARCH_MBED */
#if !defined(ARDUINO_ARCH_ZEPHYR)
#include <ArduinoJson.h>

#include "nrf_wdt.h"
#endif /* ARDUINO_ARCH_ZEPHYR */

#include "../system/SoC.h"
#include "../driver/RF.h"
#include "../driver/EEPROM.h"
#include "../driver/GNSS.h"
#include "../driver/Baro.h"
#include "../driver/LED.h"
#include "../driver/Bluetooth.h"
#include "../driver/EPD.h"
#include "../driver/Battery.h"
#include "../driver/Sound.h"
#include "../protocol/data/NMEA.h"
#include "../protocol/data/GDL90.h"
#include "../protocol/data/D1090.h"
#if !defined(ARDUINO_ARCH_ZEPHYR)
#include "../protocol/data/JSON.h"
#endif /* ARDUINO_ARCH_ZEPHYR */
#include "../system/Time.h"

#include "uCDB.hpp"

#if defined(USE_BLE_MIDI)
#include <bluefruit.h>
#endif /* USE_BLE_MIDI */

#if defined(USE_BLE_MIDI) || defined(USE_USB_MIDI)
#include <MIDI.h>
#endif /* USE_BLE_MIDI || USE_USB_MIDI */

#if defined(ENABLE_REMOTE_ID)
#include "../protocol/radio/RemoteID.h"
#endif /* ENABLE_REMOTE_ID */

#if defined(USE_TFT)
#include <TFT_eSPI.h>
#endif /* USE_TFT */

#if defined(USE_OLED)
#include "../driver/OLED.h"

extern U8X8 u8x8_i2c;
#endif /* USE_OLED */

typedef volatile uint32_t REG32;
#define pREG32 (REG32 *)

#define DEVICE_ID_HIGH    (*(pREG32 (0x10000060)))
#define DEVICE_ID_LOW     (*(pREG32 (0x10000064)))

#define EPD_STACK_SZ      (256*3)

// RFM95W pin mapping
lmic_pinmap lmic_pins = {
    .nss = SOC_GPIO_PIN_SS,
    .txe = LMIC_UNUSED_PIN,
    .rxe = LMIC_UNUSED_PIN,
    .rst = SOC_GPIO_PIN_PCA10059_RST,
    .dio = {LMIC_UNUSED_PIN, LMIC_UNUSED_PIN, LMIC_UNUSED_PIN},
    .busy = SOC_GPIO_PIN_BUSY,
    .tcxo = LMIC_UNUSED_PIN,
};

#if !defined(EXCLUDE_LED_RING)
// Parameter 1 = number of pixels in strip
// Parameter 2 = Arduino pin number (most are valid)
// Parameter 3 = pixel type flags, add together as needed:
//   NEO_KHZ800  800 KHz bitstream (most NeoPixel products w/WS2812 LEDs)
//   NEO_KHZ400  400 KHz (classic 'v1' (not v2) FLORA pixels, WS2811 drivers)
//   NEO_GRB     Pixels are wired for GRB bitstream (most NeoPixel products)
//   NEO_RGB     Pixels are wired for RGB bitstream (v1 FLORA pixels, not v2)
Adafruit_NeoPixel strip = Adafruit_NeoPixel(PIX_NUM, SOC_GPIO_PIN_LED,
                                            NEO_GRB + NEO_KHZ800);
#endif /* EXCLUDE_LED_RING */

#if defined(EXCLUDE_WIFI)
char UDPpacketBuffer[256]; // Dummy definition to satisfy build sequence
#else
#if defined(USING_WIFI101_GENERIC) || defined(WiFiNINA_h)
#include <SoftSPI.h>
SoftSPI WiFiSPI(_PINNUM(1, 7), _PINNUM(1, 6), _PINNUM(0, 8));
#endif /* USING_WIFI101_GENERIC || WiFiNINA_h */
#endif /* EXCLUDE_WIFI */

static uint32_t prev_tx_packets_counter = 0;
static uint32_t prev_rx_packets_counter = 0;

static struct rst_info reset_info = {
  .reason = REASON_DEFAULT_RST,
};

static uint32_t bootCount __attribute__ ((section (".noinit")));

static nRF52_board_id nRF52_board = NRF52_LILYGO_TECHO_REV_2; /* default */
static nRF52_display_id nRF52_display = EP_UNKNOWN;

const char *nRF5x_Device_Manufacturer = SOFTRF_IDENT;
const char *nRF5x_Device_Model = "Badge Edition";
const uint16_t nRF52_Device_Version = SOFTRF_USB_FW_VERSION;
static uint16_t nRF52_USB_VID = 0x239A; /* Adafruit Industries */
static uint16_t nRF52_USB_PID = 0x8029; /* Feather nRF52840 Express */

const char *Hardware_Rev[] = {
  [0] = "2020-8-6",
  [1] = "2020-12-12",
  [2] = "2021-3-26",
  [3] = "Unknown"
};

const prototype_entry_t techo_prototype_boards[] = {
  { 0x684f99bd2d5c7fae, NRF52_LILYGO_TECHO_REV_0, EP_GDEP015OC1,  0 }, /* orange */
  { 0xf353e11726ea8220, NRF52_LILYGO_TECHO_REV_0, EP_GDEH0154D67, 0 }, /* blue   */
  { 0xf4e0f04ded1892da, NRF52_LILYGO_TECHO_REV_1, EP_GDEH0154D67, 0 }, /* green  */
  { 0x65ab5994ea2c9094, NRF52_LILYGO_TECHO_REV_1, EP_GDEH0154D67, 0 }, /* blue   */
  { 0x6460429ea6fb7e39, NRF52_NORDIC_PCA10059,    EP_UNKNOWN,     0 },
/*{ 0x0b0e14e96a3beb79, NRF52_ELECROW_TN_M1,      EP_GDEH0154D67, 0 },*/
};

#if !defined(ARDUINO_ARCH_MBED) && !defined(ARDUINO_ARCH_ZEPHYR)
I2CBus        *i2c   = nullptr;
PCF8563_Class *rtc   = nullptr;
//RTC_RX8900_U  *rtc_2 = nullptr;
#endif /* ARDUINO_ARCH_MBED */

static bool nRF52_has_rtc      = false;
static bool nRF52_has_spiflash = false;
static bool RTC_sync           = false;
static bool FATFS_is_mounted   = false;
static bool ADB_is_open        = false;
static bool screen_saver       = false;
static bool nRF52_has_vff      = false; /* very first fix */

#if !defined(ARDUINO_ARCH_MBED) && !defined(ARDUINO_ARCH_ZEPHYR)
RTC_Date fw_build_date_time = RTC_Date(__DATE__, __TIME__);

static TaskHandle_t EPD_Task_Handle = NULL;
#else
#define ledOn(x)  {} /* TBD */
#define ledOff(x) {} /* TBD */

#define PIN_LED1  0 /* TBD */
#define PIN_LED2  0 /* TBD */
#define PIN_LED3  0 /* TBD */
#define PIN_LED4  0 /* TBD */
#endif /* ARDUINO_ARCH_MBED */

