lyusupov/SoftRF/software/firmware/source/SoftRF/src/platform/nRF52.cpp
#if !defined(ARDUINO_NRF52840_PCA10056) && \
    !defined(ARDUINO_ARCH_MBED)         && \
    !defined(ARDUINO_ARCH_ZEPHYR)
#error "This nRF52 build variant is not supported!"
#endif

#if SPI_32MHZ_INTERFACE == 0
#define _SPI_DEV    NRF_SPIM3 // 32 Mhz
#define _SPI1_DEV   NRF_SPIM2
#elif SPI_32MHZ_INTERFACE == 1
#define _SPI_DEV    NRF_SPIM2
#define _SPI1_DEV   NRF_SPIM3 // 32 Mhz
#else
  #error "not supported yet"
#endif

#if defined(USE_EPAPER)

#if SPI_INTERFACES_COUNT == 1
SPIClass SPI1(_SPI1_DEV,
              SOC_GPIO_PIN_EPD_MISO,
              SOC_GPIO_PIN_EPD_SCK,
              SOC_GPIO_PIN_EPD_MOSI);
#endif

GxEPD2_GFX *display = NULL;
#endif /* USE_EPAPER */

#if defined(USE_TFT)
static TFT_eSPI *tft = NULL;

#if !defined(USE_OLED)
static const char SoftRF_text1[]  = "SoftRF";
static const char ID_text[]       = "ID";
static const char PROTOCOL_text[] = "PROTOCOL";
static const char RX_text[]       = "RX";
static const char TX_text[]       = "TX";
#endif /* USE_OLED */

static bool TFT_display_frontpage = false;

static void TFT_off()
{
    tft->writecommand(TFT_DISPOFF);
    tft->writecommand(TFT_SLPIN);
}

static void TFT_backlight_adjust(uint32_t pin, uint8_t level)
{
    analogWrite(pin, 255 - level);
}
#endif /* USE_TFT */

#if !defined(ARDUINO_ARCH_MBED) && !defined(ARDUINO_ARCH_ZEPHYR)
static Adafruit_FlashTransport_QSPI *FlashTrans = NULL;
static Adafruit_SPIFlash            *SPIFlash   = NULL;

#define SFLASH_CMD_READ_CONFIG  0x15

static uint32_t spiflash_id = 0;
static uint8_t mx25_status_config[3] = {0x00, 0x00, 0x00};

/// Flash device list count
enum {
  MX25R1635F_INDEX,
  ZD25WQ16B_INDEX,

  ZD25WQ32C_INDEX,
  ZD25Q32D_INDEX,

  GD25Q64C_INDEX,
#if !defined(EXCLUDE_WIP)
  P25Q16H_INDEX,
#endif /* EXCLUDE_WIP */
  EXTERNAL_FLASH_DEVICE_COUNT
};

/// List of all possible flash devices used by nRF52840 boards
static SPIFlash_Device_t possible_devices[] = {
  // LilyGO T-Echo, Elecrow ThinkNode M1
  [MX25R1635F_INDEX] = MX25R1635F,
  // LilyGO T-Echo
  [ZD25WQ16B_INDEX]  = ZD25WQ16B,

  // LilyGO T-Impulse Plus, T-Echo Card
  [ZD25WQ32C_INDEX]  = ZD25WQ32C,
  [ZD25Q32D_INDEX]   = ZD25Q32D,

  // Seeed T1000-E, X1
  [GD25Q64C_INDEX]   = GD25Q64C,
#if !defined(EXCLUDE_WIP)
  // Seeed Wio L1
  [P25Q16H_INDEX]    = P25Q16H,
#endif /* EXCLUDE_WIP */
};

// USB Mass Storage object
Adafruit_USBD_MSC usb_msc;

// file system object from SdFat
FatVolume fatfs;
#endif /* ARDUINO_ARCH_MBED */

#define NRF52_JSON_BUFFER_SIZE  1024

#if !defined(ARDUINO_ARCH_ZEPHYR)
StaticJsonBuffer<NRF52_JSON_BUFFER_SIZE> nRF52_jsonBuffer;
#endif /* ARDUINO_ARCH_ZEPHYR */

#if defined(USE_WEBUSB_SERIAL) || defined(USE_WEBUSB_SETTINGS)
// USB WebUSB object
Adafruit_USBD_WebUSB usb_web;
#endif

#if defined(USE_WEBUSB_SERIAL)
// Landing Page: scheme (0: http, 1: https), url
WEBUSB_URL_DEF(landingPage, 1 /*https*/, "adafruit.github.io/Adafruit_TinyUSB_Arduino/examples/webusb-serial/index.html");
#endif /* USE_WEBUSB_SERIAL */

#if defined(USE_WEBUSB_SETTINGS)
// Landing Page: scheme (0: http, 1: https), url
WEBUSB_URL_DEF(landingPage, 1 /*https*/, "lyusupov.github.io/SoftRF/settings.html");
#endif /* USE_WEBUSB_SETTINGS */

#if defined(USE_USB_MIDI)
// USB MIDI object
Adafruit_USBD_MIDI usb_midi;

// Create a new instance of the Arduino MIDI Library,
// and attach usb_midi as the transport.
MIDI_CREATE_INSTANCE(Adafruit_USBD_MIDI, usb_midi, MIDI_USB);
#endif /* USE_USB_MIDI */

ui_settings_t ui_settings = {
#if !defined(ARDUINO_ARCH_MBED) && !defined(ARDUINO_ARCH_ZEPHYR)
    .units        = UNITS_METRIC,
    .zoom         = ZOOM_MEDIUM,
    .protocol     = PROTOCOL_NMEA,
    .rotate       = ROTATE_0,
    .orientation  = DIRECTION_TRACK_UP,
    .adb          = DB_OGN,
    .idpref       = ID_TYPE,
    .vmode        = VIEW_MODE_STATUS,
    .voice        = VOICE_OFF,
    .aghost       = ANTI_GHOSTING_OFF,
    .filter       = TRAFFIC_FILTER_OFF,
    .team         = 0
#endif /* ARDUINO_ARCH_MBED */
};

ui_settings_t *ui;

#include <SensorLib_Version.h>
#if !defined(EXCLUDE_IMU)
#define IMU_UPDATE_INTERVAL 500 /* ms */

#include <MPU9250.h>
#include <ICM_20948.h>
#include <QMA6100P.h>
#if !defined(EXCLUDE_BHI260)
#include <SensorBHI260AP.hpp>
#include <bosch/BoschSensorDataHelper.hpp>
#include <Adafruit_LIS3DH.h>

#if defined(USE_BHI260_RAM_FW)
#if SENSORLIB_VERSION == SENSORLIB_VERSION_VAL(0, 3, 1)
#include "bosch/firmware/bosch_app30_shuttle_bhi260.h"
#endif /* (0, 3, 1) */
#if SENSORLIB_VERSION >= SENSORLIB_VERSION_VAL(0, 4, 0)
#include "bosch/firmware/bhi260/bosch_app30_shuttle_bhi260.h"
#endif /* (0, 4, 0) */
#endif /* USE_BHI260_RAM_FW */
#endif /* EXCLUDE_BHI260 */

MPU9250         imu_1;
ICM_20948_I2C   imu_2;
QMA6100P        imu_3;
#if !defined(EXCLUDE_BHI260)
SensorBHI260AP  imu_4;
#endif /* EXCLUDE_BHI260 */
Adafruit_LIS3DH imu_5;

#if !defined(EXCLUDE_BHI260)
#if SENSORLIB_VERSION == SENSORLIB_VERSION_VAL(0, 3, 1)
SensorXYZ bhi_accel(SensorBHI260AP::ACCEL_PASSTHROUGH, imu_4);
// SensorXYZ bhi_gyro(SensorBHI260AP::GYRO_PASSTHROUGH, imu_4);
#endif /* (0, 3, 1) */
#if SENSORLIB_VERSION >= SENSORLIB_VERSION_VAL(0, 4, 0)
SensorXYZ bhi_accel(BoschSensorID::ACCEL_PASSTHROUGH, imu_4);
#endif /* (0, 4, 0) */
#endif /* EXCLUDE_BHI260 */

static bool nRF52_has_imu = false;
static unsigned long IMU_Time_Marker = 0;

extern float   IMU_g;
#if defined(USE_OLED)
extern int32_t IMU_g_x10;
#endif /* USE_OLED */
#endif /* EXCLUDE_IMU */

#if SENSORLIB_VERSION == SENSORLIB_VERSION_VAL(0, 3, 1)
#include <SensorDRV2605.hpp>
SensorDRV2605 vibra;
#endif /* (0, 3, 1) */
#if SENSORLIB_VERSION >= SENSORLIB_VERSION_VAL(0, 4, 1)
#include <HapticDrivers.hpp>
HapticDriver_DRV2605 vibra;
#endif /* (0, 4, 1) */

static bool nRF52_has_vibra = false;

#include <AHT20.h>
AHT20 aht20;

#if WIRE_INTERFACES_COUNT == 1
#if defined __has_include
#if __has_include(<FlexWire.h>)
#include <FlexWire.h>
FlexWire Wire1;
#else
TwoWire Wire1(NRF_TWIM1, NRF_TWIS1, SPIM1_SPIS1_TWIM1_TWIS1_SPI1_TWI1_IRQn,
              SOC_GPIO_PIN_TIP_SDA, SOC_GPIO_PIN_TIP_SCL);
extern "C"
{
  void SPIM1_SPIS1_TWIM1_TWIS1_SPI1_TWI1_IRQHandler(void)
  {
    #if CFG_SYSVIEW
    SEGGER_SYSVIEW_RecordEnterISR();
    #endif

    Wire1.onService();

    #if CFG_SYSVIEW
    SEGGER_SYSVIEW_RecordExitISR();
    #endif
  }
}
#endif /* FlexWire.h */
#endif /* __has_include */
#endif /* WIRE_INTERFACES_COUNT */

#if !defined(ARDUINO_ARCH_MBED) && !defined(ARDUINO_ARCH_ZEPHYR)
uCDB<FatVolume, File32> ucdb(fatfs);

