lyusupov/SoftRF/software/firmware/source/SoftRF/src/platform/nRF52.cpp
#if !defined(EXCLUDE_AUDIO)
  headerState_t state = HEADER_RIFF;

  File wavfile = fatfs.open(filename, FILE_READ);

  if (wavfile) {
    int c = 0;
    int n;

    while (wavfile.available()) {
      switch(state){
        case HEADER_RIFF:
        {
          wavRiff_t wavRiff;

          n = wavfile.read((uint8_t *) &wavRiff, sizeof(wavRiff_t));
          if (n == sizeof(wavRiff_t)) {
            if (wavRiff.chunkID == CCCC('R', 'I', 'F', 'F') &&
                wavRiff.format  == CCCC('W', 'A', 'V', 'E')) {
              state = HEADER_FMT;
              // Serial.println("HEADER_RIFF");
            }
          }
        }
        break;
        case HEADER_FMT:
        {
          n = wavfile.read((uint8_t *) &wavProps, sizeof(wavProperties_t));
          if (n == sizeof(wavProperties_t)) {
            state = HEADER_DATA;
          }
        }
        break;
        case HEADER_DATA:
        {
          uint32_t chunkId, chunkSize;
          n = wavfile.read((uint8_t *) &chunkId, sizeof(chunkId));
          if (n == 4) {
            if(chunkId == CCCC('d', 'a', 't', 'a')) {
              // Serial.println("HEADER_DATA");
            }
          }
          n = wavfile.read((uint8_t *) &chunkSize, sizeof(chunkSize));
          if (n == 4) {
            state = DATA;
          }

          I2S_begin(SOC_GPIO_PIN_I2S_TEC_DOUT,
                    SOC_GPIO_PIN_I2S_TEC_BCK,
                    SOC_GPIO_PIN_I2S_TEC_LRCK,
                    SOC_GPIO_PIN_I2S_TEC_MCK);
          I2S_setSampleRate(wavProps.sampleRate);
        }
        break;
        /* after processing wav header, it is time to process music data */
        case DATA:
        while ((n = wavfile.read((uint8_t *) i2s_buffer, sizeof(i2s_buffer))) > 0) {

          NRF_I2S->RXTXD.MAXCNT = n >> 2;
          NRF_I2S->TXD.PTR =  (uint32_t) i2s_buffer;
          NRF_I2S->ENABLE  = 1;
          NRF_I2S->TASKS_START = 1;

          NRF_I2S->EVENTS_RXPTRUPD = 0;
          NRF_I2S->EVENTS_TXPTRUPD = 0;
          NRF_I2S->EVENTS_STOPPED  = 0;

          while (NRF_I2S->EVENTS_TXPTRUPD == 0);
        }

        if (n == 0) {
          NRF_I2S->TASKS_START = 0;
          NRF_I2S->ENABLE = 0;
        }
        break;
      }
    }
    wavfile.close();
    rval = true;
  } else {
    Serial.println(F("error opening WAV file"));
  }
  if (state == DATA) {
    I2S_stop();
  }
#endif /* EXCLUDE_AUDIO */

  return rval;
}
#endif /* USE_EXT_I2S_DAC */

#if defined(ENABLE_RECORDER)
#define SD_CONFIG SdSpiConfig(uSD_SS_pin, SHARED_SPI, SD_SCK_MHZ(8), &SPI)

SdFat uSD;

static bool uSD_is_attached = false;
#endif /* ENABLE_RECORDER */

#if !defined(EXCLUDE_LED_RING)
Adafruit_NeoPixel T114_Pixels = Adafruit_NeoPixel(2, SOC_GPIO_PIN_T114_LED,
                                                  NEO_GRB + NEO_KHZ800);
#if 0
Adafruit_NeoPixel TEC_Pixel1  = Adafruit_NeoPixel(1, SOC_GPIO_LED_TEC_LED1,
                                                  NEO_GRB + NEO_KHZ800);
Adafruit_NeoPixel TEC_Pixel2  = Adafruit_NeoPixel(1, SOC_GPIO_LED_TEC_LED2,
                                                  NEO_GRB + NEO_KHZ800);
Adafruit_NeoPixel TEC_Pixel3  = Adafruit_NeoPixel(1, SOC_GPIO_LED_TEC_LED3,
                                                  NEO_GRB + NEO_KHZ800);
#endif
#endif /* EXCLUDE_LED_RING */

#if !defined(ARDUINO_ARCH_MBED) && !defined(ARDUINO_ARCH_ZEPHYR)
#include <SenseCAP.h>
#endif /* ARDUINO_ARCH_MBED */
#include <SGM41562.h>

#if defined(ENABLE_NFC)
#include <NFC.h>

extern "C" int nfcpins_enable(void);

void nfc_func(void *context, nfc_t2t_event_t event,
              const uint8_t *data, size_t dataLength)
{
    (void) context;

    switch (event)
    {
        case NFC_T2T_EVENT_FIELD_ON:
#if 0
            Serial.println("******NFC_T2T_EVENT_FIELD_ON******");
#endif
            break;

        case NFC_T2T_EVENT_FIELD_OFF:
#if 0
            Serial.println("------NFC_T2T_EVENT_FIELD_OFF------");
#endif
            break;

        default:
            break;
    }
}
#endif /* ENABLE_NFC */

static bool nRF52_bl_check(const char* signature)
{
  int  i, j;
  bool match    = false;
  int str_len   = strlen(signature);
  uint8_t* data = (uint8_t*) 0x000F4000UL;
  int length    = 0xFE000 - 0xF4000 - 2048 ; /* 38 KB */
  int offset    = 0x07000 ;

  data   += offset;
  length -= offset;

  for (i = 0; i < length - str_len; i++) {
    if (data[i] == signature[0]) {
      match = true;
      for (j = 1; j < str_len; j++) {
        if (data[i + j] != signature[j]) {
            match = false;
            break;
        }
      }
      if (match) {
        return true;
      }
    }
  }
  return false;
}

static void nRF52_system_off()
{
#if !defined(ARDUINO_ARCH_MBED) && !defined(ARDUINO_ARCH_ZEPHYR)
  uint8_t sd_en;
  (void) sd_softdevice_is_enabled(&sd_en);

  // Enter System OFF state
  if ( sd_en ) {
    sd_power_system_off();
  } else {
    NRF_POWER->SYSTEMOFF = 1;
  }
#else
  NRF_POWER->SYSTEMOFF = 1;
#endif /* ARDUINO_ARCH_MBED */
}

static void nRF52_setup()
{
  ui = &ui_settings;

#if !defined(ARDUINO_ARCH_MBED) && !defined(ARDUINO_ARCH_ZEPHYR)
  uint32_t reset_reason = readResetReason();
#else
  uint32_t reset_reason = 0; /* TBD */
#endif /* ARDUINO_ARCH_MBED */

  if      (reset_reason & POWER_RESETREAS_RESETPIN_Msk)
  {
      reset_info.reason = REASON_EXT_SYS_RST;
  }
  else if (reset_reason & POWER_RESETREAS_DOG_Msk)
  {
      reset_info.reason = REASON_WDT_RST;
  }
  else if (reset_reason & POWER_RESETREAS_SREQ_Msk)
  {
      reset_info.reason = REASON_SOFT_RESTART;
  }
  else if (reset_reason & POWER_RESETREAS_LOCKUP_Msk)
  {
      reset_info.reason = REASON_SOFT_WDT_RST;
  }
  else if (reset_reason & POWER_RESETREAS_OFF_Msk)
  {
      reset_info.reason = REASON_DEEP_SLEEP_AWAKE;
  }
  else if (reset_reason & POWER_RESETREAS_LPCOMP_Msk)
  {
      reset_info.reason = REASON_DEEP_SLEEP_AWAKE;
  }
  else if (reset_reason & POWER_RESETREAS_DIF_Msk)
  {
      reset_info.reason = REASON_DEEP_SLEEP_AWAKE;
  }
  else if (reset_reason & POWER_RESETREAS_NFC_Msk)
  {
      reset_info.reason = REASON_DEEP_SLEEP_AWAKE;
  }
  else if (reset_reason & POWER_RESETREAS_VBUS_Msk)
  {
      reset_info.reason = REASON_DEEP_SLEEP_AWAKE;
  }

  /* inactivate initVariant() of PCA10056 */
  pinMode(PIN_LED1, INPUT);
  pinMode(PIN_LED2, INPUT);
  pinMode(PIN_LED3, INPUT);
  pinMode(PIN_LED4, INPUT);

  nRF52_board = nRF52_bl_check("TECHOBOOT")      ? NRF52_LILYGO_TECHO_REV_2   :
                nRF52_bl_check("T1000-E")        ? NRF52_SEEED_T1000E         :
                nRF52_bl_check("HT-n5262")       ? NRF52_HELTEC_T114          :
                nRF52_bl_check("ThinkNodeM3")    ? NRF52_ELECROW_TN_M3        :
                nRF52_bl_check("ThinkNodeM6")    ? NRF52_ELECROW_TN_M6        :
                nRF52_bl_check("ThinkNodeM8")    ? NRF52_ELECROW_TN_M8        :
                nRF52_bl_check("ELECROWBOOT")    ? NRF52_ELECROW_TN_M1        :
                nRF52_bl_check("T-Impulse-Plus") ? NRF52_LILYGO_TIMPULSE_PLUS :
                nRF52_bl_check("T-Echo-Card")    ? NRF52_LILYGO_TECHO_CARD    :
                nRF52_bl_check("MeshTracker-X1") ? NRF52_SEEED_X1             :
#if !defined(EXCLUDE_WIP)
                nRF52_bl_check("T2000")          ? NRF52_SEEED_T2000          :
                nRF52_bl_check("TRACKER L1")     ? NRF52_SEEED_WIO_L1         :
#endif /* EXCLUDE_WIP */
                nRF52_board;

  for (int i=0; i < sizeof(techo_prototype_boards) / sizeof(prototype_entry_t); i++) {
    if (techo_prototype_boards[i].id == ((uint64_t) DEVICE_ID_HIGH << 32 | (uint64_t) DEVICE_ID_LOW)) {
      nRF52_board   = techo_prototype_boards[i].rev;
      nRF52_display = techo_prototype_boards[i].panel;
      break;
    }
  }

  switch (nRF52_board)
  {
    case NRF52_SEEED_T1000E:
      hw_info.model      = SOFTRF_MODEL_CARD;
      nRF5x_Device_Model = "Card Edition";
      nRF52_USB_VID      = 0x2886; /* Seeed Technology */
      nRF52_USB_PID      = 0x0057; /* SenseCAP T1000-E */

