lyusupov/SoftRF/software/firmware/source/SoftRF/src/platform/nRF52.cpp
      if (reset_reason & POWER_RESETREAS_VBUS_Msk ||
          reset_reason & POWER_RESETREAS_RESETPIN_Msk) {
        NRF_POWER->GPREGRET = DFU_MAGIC_SKIP;
#if !defined(ARDUINO_ARCH_MBED) && !defined(ARDUINO_ARCH_ZEPHYR)
        pinMode(SOC_GPIO_PIN_T1000_BUTTON, INPUT_PULLDOWN_SENSE /* INPUT_SENSE_HIGH */);
#endif /* ARDUINO_ARCH_MBED */
        nRF52_system_off();
      }

      digitalWrite(SOC_GPIO_PIN_SFL_T1000_EN, HIGH);
      pinMode(SOC_GPIO_PIN_SFL_T1000_EN, OUTPUT);

      // digitalWrite(SOC_GPIO_LED_T1000_RED, HIGH);
      // pinMode(SOC_GPIO_LED_T1000_RED, OUTPUT);
      break;

    case NRF52_SEEED_X1:
      hw_info.model      = SOFTRF_MODEL_CARD_MK3;
      nRF5x_Device_Model = "Card Edition Mk3";
      nRF52_USB_VID      = 0x2886; /* Seeed Technology */
      nRF52_USB_PID      = 0x0057;
#if 0 /* TODO */
      if (reset_reason & POWER_RESETREAS_VBUS_Msk ||
          reset_reason & POWER_RESETREAS_RESETPIN_Msk) {
        NRF_POWER->GPREGRET = DFU_MAGIC_SKIP;
#if !defined(ARDUINO_ARCH_MBED) && !defined(ARDUINO_ARCH_ZEPHYR)
        pinMode(SOC_GPIO_PIN_X1_BUTTON, INPUT_PULLDOWN_SENSE /* INPUT_SENSE_HIGH */);
#endif /* ARDUINO_ARCH_MBED */
        nRF52_system_off();
      }
#endif
      digitalWrite(SOC_GPIO_PIN_SFL_X1_EN, HIGH);
      pinMode(SOC_GPIO_PIN_SFL_X1_EN, OUTPUT);
      digitalWrite(SOC_GPIO_PIN_X1_HAPTIC_EN, HIGH);
      pinMode(SOC_GPIO_PIN_X1_HAPTIC_EN, OUTPUT);
      digitalWrite(SOC_GPIO_PIN_X1_RTC_EN, HIGH);
      pinMode(SOC_GPIO_PIN_X1_RTC_EN, OUTPUT);

      break;

#if !defined(EXCLUDE_WIP)
    case NRF52_SEEED_WIO_L1:
      hw_info.model      = SOFTRF_MODEL_DECENT;
      nRF5x_Device_Model = "Decent Edition";
      nRF52_USB_VID      = 0x2886; /* Seeed Technology */
      nRF52_USB_PID      = 0x1668; /* Wio Tracker L1 */

      if (reset_reason & POWER_RESETREAS_VBUS_Msk) {
        NRF_POWER->GPREGRET = DFU_MAGIC_SKIP;
#if !defined(ARDUINO_ARCH_MBED) && !defined(ARDUINO_ARCH_ZEPHYR)
        pinMode(SOC_GPIO_PIN_L1_BUTTON, INPUT_PULLUP_SENSE);
#endif /* ARDUINO_ARCH_MBED */
        nRF52_system_off();
      }

      break;

    case NRF52_SEEED_T2000:
      hw_info.model      = SOFTRF_MODEL_RUGGED;
      nRF5x_Device_Model = "Rugged Edition";
      nRF52_USB_VID      = 0x2886; /* Seeed Technology */
      nRF52_USB_PID      = 0x1668; /* TBD */

      if (reset_reason & POWER_RESETREAS_VBUS_Msk) {
        NRF_POWER->GPREGRET = DFU_MAGIC_SKIP;
#if !defined(ARDUINO_ARCH_MBED) && !defined(ARDUINO_ARCH_ZEPHYR)
        pinMode(SOC_GPIO_PIN_T2000_BUTTON, INPUT_PULLUP_SENSE);
#endif /* ARDUINO_ARCH_MBED */
        nRF52_system_off();
      }

      break;
#endif /* EXCLUDE_WIP */

    case NRF52_HELTEC_T114:
      hw_info.model      = SOFTRF_MODEL_COZY;
      nRF5x_Device_Model = "Cozy Edition";

      if (reset_reason & POWER_RESETREAS_VBUS_Msk) {
        NRF_POWER->GPREGRET = DFU_MAGIC_SKIP;
#if !defined(ARDUINO_ARCH_MBED) && !defined(ARDUINO_ARCH_ZEPHYR)
        pinMode(SOC_GPIO_PIN_T114_BUTTON, INPUT_PULLUP_SENSE);
#endif /* ARDUINO_ARCH_MBED */
        nRF52_system_off();
      }

      break;

    case NRF52_ELECROW_TN_M1: /* "ELECROWBOOT" */
    case NRF52_ELECROW_TN_M3: /* "ELECROWBOOT" , "ThinkNodeM3" */
      pinMode(SOC_GPIO_PIN_M3_EEPROM_EN,  INPUT_PULLUP);
      pinMode(SOC_GPIO_PIN_M3_TEMP_EN,    INPUT_PULLUP);
      delay(5);

#if !defined(ARDUINO_ARCH_MBED) && !defined(ARDUINO_ARCH_ZEPHYR)
      Wire.setPins(SOC_GPIO_PIN_M3_SDA, SOC_GPIO_PIN_M3_SCL);
#endif /* ARDUINO_ARCH_MBED */
      Wire.begin();
      Wire.beginTransmission(AHT20_ADDRESS);
      if (Wire.endTransmission() == 0) {
        nRF52_board        = NRF52_ELECROW_TN_M3;
        hw_info.model      = SOFTRF_MODEL_POCKET;
        nRF5x_Device_Model = "Pocket Edition";
      } else {
        hw_info.model      = SOFTRF_MODEL_HANDHELD;
        nRF5x_Device_Model = "Handheld Edition";
      }
      Wire.end();
      pinMode(SOC_GPIO_PIN_M3_TEMP_EN,    INPUT);
      pinMode(SOC_GPIO_PIN_M3_EEPROM_EN,  INPUT);

      if (reset_reason & POWER_RESETREAS_VBUS_Msk) {
        NRF_POWER->GPREGRET = DFU_MAGIC_SKIP;
#if !defined(ARDUINO_ARCH_MBED) && !defined(ARDUINO_ARCH_ZEPHYR)
        pinMode(nRF52_board == NRF52_ELECROW_TN_M1 ?
                SOC_GPIO_PIN_M1_BUTTON1 : SOC_GPIO_PIN_M3_BUTTON,
                INPUT_PULLUP_SENSE);
#endif /* ARDUINO_ARCH_MBED */
        nRF52_system_off();
      }

      break;

    case NRF52_ELECROW_TN_M6: /* "ThinkNodeM6" */
      hw_info.model      = SOFTRF_MODEL_SOLARIS;
      nRF5x_Device_Model = "Solaris Edition";

      if (reset_reason & POWER_RESETREAS_VBUS_Msk ||
          reset_reason & POWER_RESETREAS_RESETPIN_Msk) {
        NRF_POWER->GPREGRET = DFU_MAGIC_SKIP;
#if !defined(ARDUINO_ARCH_MBED) && !defined(ARDUINO_ARCH_ZEPHYR)
        pinMode(SOC_GPIO_PIN_M6_BUTTON, INPUT_PULLUP_SENSE);
#endif /* ARDUINO_ARCH_MBED */
        nRF52_system_off();
      }

      pinMode(SOC_GPIO_PIN_SFL_M6_EN, INPUT_PULLUP);
      break;

    case NRF52_LILYGO_TIMPULSE_PLUS:
      hw_info.model      = SOFTRF_MODEL_STYLUS;
      nRF5x_Device_Model = "Stylus Edition";

      if (reset_reason & POWER_RESETREAS_VBUS_Msk ||
          reset_reason & POWER_RESETREAS_RESETPIN_Msk) {
        NRF_POWER->GPREGRET = DFU_MAGIC_SKIP;
#if !defined(ARDUINO_ARCH_MBED) && !defined(ARDUINO_ARCH_ZEPHYR)
        pinMode(SOC_GPIO_PIN_TIP_PAD, INPUT_PULLUP_SENSE); /* TBD */
#endif /* ARDUINO_ARCH_MBED */
        nRF52_system_off();
      }
      break;

    case NRF52_LILYGO_TECHO_CARD:
      hw_info.model      = SOFTRF_MODEL_CARD_MK2;
      nRF5x_Device_Model = "Card Edition Mk2";

      if (reset_reason & POWER_RESETREAS_VBUS_Msk ||
          reset_reason & POWER_RESETREAS_RESETPIN_Msk) {
        NRF_POWER->GPREGRET = DFU_MAGIC_SKIP;
#if !defined(ARDUINO_ARCH_MBED) && !defined(ARDUINO_ARCH_ZEPHYR)
        pinMode(SOC_GPIO_PIN_TEC_BUTTON, INPUT_PULLUP_SENSE); /* TBD */
#endif /* ARDUINO_ARCH_MBED */
        nRF52_system_off();
      }
      break;

    case NRF52_LILYGO_TECHO_REV_0:
    case NRF52_LILYGO_TECHO_REV_1:
    case NRF52_LILYGO_TECHO_REV_2:
    case NRF52_LILYGO_TECHO_PLUS:
    case NRF52_NORDIC_PCA10059:
    default:
      pinMode(SOC_GPIO_PIN_3V3_PWR, INPUT);
      pinMode(SOC_GPIO_PIN_IO_PWR,  INPUT_PULLUP);
      if (nRF52_board == NRF52_LILYGO_TECHO_REV_1) {
        pinMode(SOC_GPIO_PIN_TECHO_REV_1_3V3_PWR,  INPUT_PULLUP);
      }
      break;
  }

#if !defined(ARDUINO_ARCH_MBED) && !defined(ARDUINO_ARCH_ZEPHYR)
  switch (nRF52_board)
  {
#if !defined(EXCLUDE_WIP)
    case NRF52_SEEED_WIO_L1:
      Wire.setPins(SOC_GPIO_PIN_L1_OLED_SDA, SOC_GPIO_PIN_L1_OLED_SCL); /* TBD */
      break;
    case NRF52_SEEED_T2000:
      Wire.setPins(SOC_GPIO_PIN_T2000_SDA, SOC_GPIO_PIN_T2000_SCL);
      break;
    case NRF52_HELTEC_T1:
      Wire.setPins(SOC_GPIO_PIN_T1_SDA, SOC_GPIO_PIN_T1_SCL);
      break;
    case NRF52_ELECROW_TN_M8:
      Wire.setPins(SOC_GPIO_PIN_M8_SDA, SOC_GPIO_PIN_M8_SCL);
      digitalWrite(SOC_GPIO_PIN_M8_IIC_EN, HIGH);
      pinMode(SOC_GPIO_PIN_M8_IIC_EN, OUTPUT);
      break;
#endif /* EXCLUDE_WIP */
    case NRF52_SEEED_T1000E:
      Wire.setPins(SOC_GPIO_PIN_T1000_SDA, SOC_GPIO_PIN_T1000_SCL);
#if !defined(EXCLUDE_IMU)
      pinMode(SOC_GPIO_PIN_T1000_ACC_EN, INPUT_PULLUP);
      delay(100);
      Wire.begin();
      Wire.beginTransmission(QMA6100P_ADDRESS);
      nRF52_has_imu = (Wire.endTransmission() == 0);
      Wire.end();
#endif /* EXCLUDE_IMU */
      break;
    case NRF52_ELECROW_TN_M3:
      Wire.setPins(SOC_GPIO_PIN_M3_SDA, SOC_GPIO_PIN_M3_SCL);

#if !defined(EXCLUDE_IMU)
      pinMode(SOC_GPIO_PIN_M3_ACC_EN,       INPUT_PULLUP);
#endif /* EXCLUDE_IMU */

      pinMode(SOC_GPIO_PIN_M3_TEMP_EN,      INPUT_PULLUP);
      pinMode(SOC_GPIO_PIN_M3_EEPROM_EN,    INPUT_PULLUP);
      break;
    case NRF52_ELECROW_TN_M6:
      Wire.setPins(SOC_GPIO_PIN_M6_SDA, SOC_GPIO_PIN_M6_SCL);
      digitalWrite(SOC_GPIO_PIN_IO_M6_PWR, HIGH);
      pinMode(SOC_GPIO_PIN_IO_M6_PWR, OUTPUT);
      break;
    case NRF52_LILYGO_TIMPULSE_PLUS:
      Wire.setPins (SOC_GPIO_PIN_TIP_OLED_SDA, SOC_GPIO_PIN_TIP_OLED_SCL);
      Wire1.setPins(SOC_GPIO_PIN_TIP_SDA,      SOC_GPIO_PIN_TIP_SCL);
#if !defined(EXCLUDE_IMU)
      Wire1.begin();
      Wire1.beginTransmission(ICM20948_ADDRESS_ALT);
      nRF52_has_imu = (Wire1.endTransmission() == 0);
      Wire1.end();
#endif /* EXCLUDE_IMU */
      break;
    case NRF52_LILYGO_TECHO_CARD:
      Wire.setPins (SOC_GPIO_PIN_TEC_SDA, SOC_GPIO_PIN_TEC_SCL);
      break;
    case NRF52_SEEED_X1:
      Wire.setPins (SOC_GPIO_PIN_X1_SDA,     SOC_GPIO_PIN_X1_SCL);
      Wire1.setPins(SOC_GPIO_PIN_X1_RTC_SDA, SOC_GPIO_PIN_X1_RTC_SCL);
      break;
    case NRF52_HELTEC_T114:
      /* external bus */
      Wire.setPins(SOC_GPIO_PIN_T114_SDA_EXT, SOC_GPIO_PIN_T114_SCL_EXT);
      break;
    case NRF52_LILYGO_TECHO_REV_0:
    case NRF52_LILYGO_TECHO_REV_1:
    case NRF52_LILYGO_TECHO_REV_2:
    case NRF52_LILYGO_TECHO_PLUS:
    case NRF52_ELECROW_TN_M1:
    case NRF52_NORDIC_PCA10059:
      digitalWrite(SOC_GPIO_PIN_IO_PWR, HIGH);
      pinMode(SOC_GPIO_PIN_IO_PWR, OUTPUT); /* VDD_POWR is ON */
    default:
      Wire.setPins(SOC_GPIO_PIN_SDA, SOC_GPIO_PIN_SCL);
      break;
  }
#endif /* ARDUINO_ARCH_MBED */

  if (nRF52_board == NRF52_SEEED_X1) {
    Wire1.begin();
    Wire1.beginTransmission(YSN8900_ADDRESS);
    nRF52_has_rtc = (Wire1.endTransmission() == 0);
    Wire1.end();
  } else {
    Wire.begin();

    Wire.beginTransmission(PCF8563_SLAVE_ADDRESS);
    nRF52_has_rtc = (Wire.endTransmission() == 0);
    if (!nRF52_has_rtc) {
      delay(5);
      Wire.beginTransmission(PCF8563_SLAVE_ADDRESS);
      nRF52_has_rtc = (Wire.endTransmission() == 0);
      if (!nRF52_has_rtc) {
        delay(5);
        Wire.beginTransmission(PCF8563_SLAVE_ADDRESS);
        nRF52_has_rtc = (Wire.endTransmission() == 0);
      }
    }

#if !defined(EXCLUDE_IMU)
    if (nRF52_board == NRF52_LILYGO_TECHO_REV_2 ||
        nRF52_board == NRF52_LILYGO_TECHO_CARD) { /* T-Echo, T114 or M1 */
      /* MPU9250 or ICM20948 start-up time for register R/W is 11-100 ms */
      delay(90);

