lyusupov/SoftRF/software/firmware/source/SoftRF/src/platform/nRF52.cpp
      Wire.beginTransmission(MPU9250_ADDRESS);
      nRF52_has_imu = (Wire.endTransmission() == 0);
      if (nRF52_has_imu == false) {
        Wire.beginTransmission(ICM20948_ADDRESS);
        nRF52_has_imu = (Wire.endTransmission() == 0);
        if (nRF52_has_imu == false) {
          Wire.beginTransmission(BHI260AP_ADDRESS_L);
          nRF52_has_imu = (Wire.endTransmission() == 0);

          if (nRF52_has_imu) {
            Wire.beginTransmission(DRV2605_ADDRESS);
            if (Wire.endTransmission() == 0) {
              nRF52_board = NRF52_LILYGO_TECHO_PLUS;
            }
          }
        }
      }
    } else if (nRF52_board == NRF52_ELECROW_TN_M3 ||
               nRF52_board == NRF52_ELECROW_TN_M8) {
      Wire.beginTransmission(SC7A20H_ADDRESS_H);
      nRF52_has_imu = (Wire.endTransmission() == 0);
    }
#endif /* EXCLUDE_IMU */

    Wire.end();
  }

#if !defined(ARDUINO_ARCH_MBED) && !defined(ARDUINO_ARCH_ZEPHYR)
  /* (Q)SPI flash init */

  switch (nRF52_board)
  {
    case NRF52_LILYGO_TECHO_REV_0:
      possible_devices[MX25R1635F_INDEX].max_clock_speed_mhz  = 33;
      possible_devices[MX25R1635F_INDEX].supports_qspi        = false;
      possible_devices[MX25R1635F_INDEX].supports_qspi_writes = false;
    case NRF52_LILYGO_TECHO_REV_1:
    case NRF52_LILYGO_TECHO_REV_2:
    case NRF52_LILYGO_TECHO_PLUS:
    case NRF52_HELTEC_T114:
    case NRF52_ELECROW_TN_M1:
    case NRF52_ELECROW_TN_M8:
      FlashTrans = new Adafruit_FlashTransport_QSPI(SOC_GPIO_PIN_SFL_SCK,
                                                    SOC_GPIO_PIN_SFL_SS,
                                                    SOC_GPIO_PIN_SFL_MOSI,
                                                    SOC_GPIO_PIN_SFL_MISO,
                                                    SOC_GPIO_PIN_SFL_WP,
                                                    SOC_GPIO_PIN_SFL_HOLD);
      break;
    case NRF52_SEEED_T1000E:
    case NRF52_SEEED_X1:
      FlashTrans = new Adafruit_FlashTransport_QSPI(SOC_GPIO_PIN_SFL_T1000_SCK,
                                                    SOC_GPIO_PIN_SFL_T1000_SS,
                                                    SOC_GPIO_PIN_SFL_T1000_MOSI,
                                                    SOC_GPIO_PIN_SFL_T1000_MISO,
                                                    SOC_GPIO_PIN_SFL_T1000_WP,
                                                    SOC_GPIO_PIN_SFL_T1000_HOLD);
      break;
    case NRF52_ELECROW_TN_M6:
      FlashTrans = new Adafruit_FlashTransport_QSPI(SOC_GPIO_PIN_SFL_M6_SCK,
                                                    SOC_GPIO_PIN_SFL_M6_SS,
                                                    SOC_GPIO_PIN_SFL_M6_MOSI,
                                                    SOC_GPIO_PIN_SFL_M6_MISO,
                                                    SOC_GPIO_PIN_SFL_M6_WP,
                                                    SOC_GPIO_PIN_SFL_M6_HOLD);
      break;
    case NRF52_LILYGO_TIMPULSE_PLUS:
      FlashTrans = new Adafruit_FlashTransport_QSPI(SOC_GPIO_PIN_SFL_TIP_SCK,
                                                    SOC_GPIO_PIN_SFL_TIP_SS,
                                                    SOC_GPIO_PIN_SFL_TIP_MOSI,
                                                    SOC_GPIO_PIN_SFL_TIP_MISO,
                                                    SOC_GPIO_PIN_SFL_TIP_WP,
                                                    SOC_GPIO_PIN_SFL_TIP_HOLD);
      break;
    case NRF52_LILYGO_TECHO_CARD:
      FlashTrans = new Adafruit_FlashTransport_QSPI(SOC_GPIO_PIN_SFL_TEC_SCK,
                                                    SOC_GPIO_PIN_SFL_TEC_SS,
                                                    SOC_GPIO_PIN_SFL_TEC_MOSI,
                                                    SOC_GPIO_PIN_SFL_TEC_MISO,
                                                    SOC_GPIO_PIN_SFL_TEC_WP,
                                                    SOC_GPIO_PIN_SFL_TEC_HOLD);
      break;
#if !defined(EXCLUDE_WIP)
    case NRF52_SEEED_WIO_L1:
      FlashTrans = new Adafruit_FlashTransport_QSPI(SOC_GPIO_PIN_SFL_L1_SCK,
                                                    SOC_GPIO_PIN_SFL_L1_SS,
                                                    SOC_GPIO_PIN_SFL_L1_MOSI,
                                                    SOC_GPIO_PIN_SFL_L1_MISO,
                                                    SOC_GPIO_PIN_SFL_L1_WP,
                                                    SOC_GPIO_PIN_SFL_L1_HOLD);
      break;
    case NRF52_SEEED_T2000:
      FlashTrans = new Adafruit_FlashTransport_QSPI(SOC_GPIO_PIN_SFL_T2000_SCK,
                                                    SOC_GPIO_PIN_SFL_T2000_SS,
                                                    SOC_GPIO_PIN_SFL_T2000_MOSI,
                                                    SOC_GPIO_PIN_SFL_T2000_MISO,
                                                    SOC_GPIO_PIN_SFL_T2000_WP,
                                                    SOC_GPIO_PIN_SFL_T2000_HOLD);
      break;
#endif /* EXCLUDE_WIP */
    case NRF52_NORDIC_PCA10059:
    case NRF52_ELECROW_TN_M3:
    default:
      break;
  }

  if (FlashTrans != NULL) {
    FlashTrans->begin();
    FlashTrans->runCommand(0xAB); /* RDP/RES */
    FlashTrans->end();

    SPIFlash = new Adafruit_SPIFlash(FlashTrans);
    nRF52_has_spiflash = SPIFlash->begin(possible_devices,
                                         EXTERNAL_FLASH_DEVICE_COUNT);
  }
#endif /* ARDUINO_ARCH_MBED */

  hw_info.storage = nRF52_has_spiflash ? STORAGE_FLASH : STORAGE_NONE;

#if !defined(ARDUINO_ARCH_MBED) && !defined(ARDUINO_ARCH_ZEPHYR)
  USBDevice.setID(nRF52_USB_VID, nRF52_USB_PID);
  USBDevice.setManufacturerDescriptor(nRF5x_Device_Manufacturer);
  USBDevice.setProductDescriptor(nRF5x_Device_Model);
  USBDevice.setDeviceVersion(nRF52_Device_Version);
#endif /* ARDUINO_ARCH_MBED */

#if defined(USE_TINYUSB)
  switch (nRF52_board)
  {
#if !defined(EXCLUDE_WIP)
    case NRF52_SEEED_T2000:
      Serial1.setPins(SOC_GPIO_PIN_CONS_T2000_RX, SOC_GPIO_PIN_CONS_T2000_TX);
#if defined(EXCLUDE_WIFI)
      Serial1.begin(SERIAL_OUT_BR, SERIAL_OUT_BITS);
#endif /* EXCLUDE_WIFI */
      break;
    case NRF52_HELTEC_T1:
      /* TBD */
      break;
#endif /* EXCLUDE_WIP */
    case NRF52_SEEED_T1000E:
    case NRF52_SEEED_X1:
      Serial1.setPins(SOC_GPIO_PIN_CONS_T1000_RX, SOC_GPIO_PIN_CONS_T1000_TX);
#if defined(EXCLUDE_WIFI)
      Serial1.begin(SERIAL_OUT_BR, SERIAL_OUT_BITS);
#endif /* EXCLUDE_WIFI */
      break;
    case NRF52_ELECROW_TN_M6:
      Serial1.setPins(SOC_GPIO_PIN_CONS_M6_RX, SOC_GPIO_PIN_CONS_M6_TX);
#if defined(EXCLUDE_WIFI)
      Serial1.begin(SERIAL_OUT_BR, SERIAL_OUT_BITS);
#endif /* EXCLUDE_WIFI */
      break;
    case NRF52_HELTEC_T114:
    case NRF52_ELECROW_TN_M1:
    case NRF52_ELECROW_TN_M3:
    case NRF52_ELECROW_TN_M8:
    case NRF52_SEEED_WIO_L1:
    case NRF52_LILYGO_TECHO_PLUS:
    case NRF52_LILYGO_TECHO_CARD:
    case NRF52_LILYGO_TIMPULSE_PLUS:
      Serial1.setPins(SOC_GPIO_PIN_CONS_T114_RX, SOC_GPIO_PIN_CONS_T114_TX);
#if defined(EXCLUDE_WIFI)
      Serial1.begin(SERIAL_OUT_BR, SERIAL_OUT_BITS);
#endif /* EXCLUDE_WIFI */
      break;
    case NRF52_LILYGO_TECHO_REV_0:
    case NRF52_LILYGO_TECHO_REV_1:
    case NRF52_LILYGO_TECHO_REV_2:
    case NRF52_NORDIC_PCA10059:
    default:
      Serial1.setPins(SOC_GPIO_PIN_CONS_RX, SOC_GPIO_PIN_CONS_TX);
#if defined(EXCLUDE_WIFI)
      Serial1.begin(SERIAL_OUT_BR, SERIAL_OUT_BITS);
#endif /* EXCLUDE_WIFI */
      break;
  }
#endif /* USE_TINYUSB */

  switch (nRF52_board)
  {
#if !defined(EXCLUDE_WIP)
    case NRF52_SEEED_WIO_L1:
      digitalWrite(SOC_GPIO_PIN_L1_VBAT_EN, HIGH);
      pinMode(SOC_GPIO_PIN_L1_VBAT_EN, OUTPUT);
      /* TBD */
      break;
    case NRF52_SEEED_T2000:
      digitalWrite(SOC_GPIO_PIN_T2000_VBAT_EN, HIGH);
      pinMode(SOC_GPIO_PIN_T2000_VBAT_EN, OUTPUT);
      /* TBD */
      break;
    case NRF52_HELTEC_T1:
      digitalWrite(SOC_GPIO_PIN_T1_ADC_EN, HIGH);
      pinMode(SOC_GPIO_PIN_T1_ADC_EN, OUTPUT);
      /* TBD */
      break;
    case NRF52_ELECROW_TN_M8:
      digitalWrite(SOC_GPIO_PIN_M8_ADC_EN, HIGH);
      pinMode(SOC_GPIO_PIN_M8_ADC_EN, OUTPUT);
      digitalWrite(SOC_GPIO_PIN_EPD_M8_EN, HIGH);
      pinMode(SOC_GPIO_PIN_EPD_M8_EN, OUTPUT);
      /* TBD */
      break;
#endif /* EXCLUDE_WIP */

