lyusupov/SoftRF/software/firmware/source/SoftRF/src/platform/nRF52.cpp
    case NRF52_SEEED_T1000E:
      digitalWrite(SOC_GPIO_PIN_T1000_3V3_EN, HIGH);
      pinMode(SOC_GPIO_PIN_T1000_3V3_EN, OUTPUT);

      digitalWrite(SOC_GPIO_PIN_T1000_BUZZER_EN, HIGH);
      pinMode(SOC_GPIO_PIN_T1000_BUZZER_EN, OUTPUT);
      break;

    case NRF52_HELTEC_T114:
      digitalWrite(SOC_GPIO_PIN_T114_VEXT_EN, HIGH);
      pinMode(SOC_GPIO_PIN_T114_VEXT_EN, OUTPUT);

      delay(200);

      digitalWrite(SOC_GPIO_PIN_T114_TFT_EN, LOW);
      pinMode(SOC_GPIO_PIN_T114_TFT_EN, OUTPUT);
      digitalWrite(SOC_GPIO_PIN_T114_TFT_BLGT, LOW);
      pinMode(SOC_GPIO_PIN_T114_TFT_BLGT, OUTPUT);

      digitalWrite(SOC_GPIO_PIN_T114_ADC_EN, HIGH);
      pinMode(SOC_GPIO_PIN_T114_ADC_EN, OUTPUT);
      break;

    case NRF52_ELECROW_TN_M1:
      /* TBD */
      // digitalWrite(SOC_GPIO_PIN_M1_DIO3, HIGH);
      // pinMode(SOC_GPIO_PIN_M1_DIO3, OUTPUT);
      break;

    case NRF52_ELECROW_TN_M3:
      digitalWrite(SOC_GPIO_PIN_M3_ADC_EN, HIGH);
      pinMode(SOC_GPIO_PIN_M3_ADC_EN, OUTPUT);

      digitalWrite(SOC_GPIO_PIN_M3_EN1, HIGH);
      pinMode(SOC_GPIO_PIN_M3_EN1, OUTPUT);
      digitalWrite(SOC_GPIO_PIN_M3_EN2, HIGH);
      pinMode(SOC_GPIO_PIN_M3_EN2, OUTPUT);

      pinMode(SOC_GPIO_PIN_M3_BUT_EN, INPUT_PULLUP);
      break;

    case NRF52_ELECROW_TN_M6:
      digitalWrite(SOC_GPIO_PIN_M6_ADC_EN, HIGH);
      pinMode(SOC_GPIO_PIN_M6_ADC_EN, OUTPUT);
      /* TBD */
      break;

    case NRF52_LILYGO_TIMPULSE_PLUS:
      digitalWrite(SOC_GPIO_PIN_TIP_3V3_EN, HIGH);
      pinMode(SOC_GPIO_PIN_TIP_3V3_EN, OUTPUT);

      digitalWrite(SOC_GPIO_PIN_TIP_VBAT_EN, HIGH);
      pinMode(SOC_GPIO_PIN_TIP_VBAT_EN, OUTPUT);
      /* TBD */
      break;

    case NRF52_LILYGO_TECHO_CARD:
      digitalWrite(SOC_GPIO_PIN_TEC_3V3_EN, HIGH);
      pinMode(SOC_GPIO_PIN_TEC_3V3_EN, OUTPUT);

      digitalWrite(SOC_GPIO_PIN_TEC_VBAT_EN, HIGH);
      pinMode(SOC_GPIO_PIN_TEC_VBAT_EN, OUTPUT);

      digitalWrite(SOC_GPIO_PIN_I2S_TEC_EN, HIGH);
      pinMode(SOC_GPIO_PIN_I2S_TEC_EN, OUTPUT);

      digitalWrite(SOC_GPIO_PIN_I2S_TEC_PWR, HIGH);
      pinMode(SOC_GPIO_PIN_I2S_TEC_PWR, OUTPUT);
      /* TBD */
      break;

    case NRF52_SEEED_X1:
      digitalWrite(SOC_GPIO_PIN_X1_3V3_EN, HIGH);
      pinMode(SOC_GPIO_PIN_X1_3V3_EN, OUTPUT);

      digitalWrite(SOC_GPIO_PIN_X1_VBAT_EN, HIGH);
      pinMode(SOC_GPIO_PIN_X1_VBAT_EN, OUTPUT);
      /* TBD */
      break;

    case NRF52_LILYGO_TECHO_REV_0:
    case NRF52_LILYGO_TECHO_REV_1:
    case NRF52_LILYGO_TECHO_REV_2:
    case NRF52_LILYGO_TECHO_PLUS:
    case NRF52_NORDIC_PCA10059:
    default:
      break;
  }

  /* GPIO pins init */
  switch (nRF52_board)
  {
    case NRF52_LILYGO_TECHO_REV_0:
      /* Wake up Air530 GNSS */
      digitalWrite(SOC_GPIO_PIN_GNSS_WKE, HIGH);
      pinMode(SOC_GPIO_PIN_GNSS_WKE, OUTPUT);

      pinMode(SOC_GPIO_LED_TECHO_REV_0_GREEN, OUTPUT);
      pinMode(SOC_GPIO_LED_TECHO_REV_0_RED,   OUTPUT);
      pinMode(SOC_GPIO_LED_TECHO_REV_0_BLUE,  OUTPUT);

      ledOn (SOC_GPIO_LED_TECHO_REV_0_GREEN);
      ledOff(SOC_GPIO_LED_TECHO_REV_0_RED);
      ledOff(SOC_GPIO_LED_TECHO_REV_0_BLUE);

      lmic_pins.rst = SOC_GPIO_PIN_TECHO_REV_0_RST;

      hw_info.revision = 0;
      hw_info.touch    = TOUCH_TTP223;
      break;

    case NRF52_LILYGO_TECHO_REV_1:
      /* Wake up Air530 GNSS */
      digitalWrite(SOC_GPIO_PIN_GNSS_WKE, HIGH);
      pinMode(SOC_GPIO_PIN_GNSS_WKE, OUTPUT);

      pinMode(SOC_GPIO_LED_TECHO_REV_1_GREEN, OUTPUT);
      pinMode(SOC_GPIO_LED_TECHO_REV_1_RED,   OUTPUT);
      pinMode(SOC_GPIO_LED_TECHO_REV_1_BLUE,  OUTPUT);

      ledOn (SOC_GPIO_LED_TECHO_REV_1_GREEN);
      ledOff(SOC_GPIO_LED_TECHO_REV_1_RED);
      ledOff(SOC_GPIO_LED_TECHO_REV_1_BLUE);

      lmic_pins.rst = SOC_GPIO_PIN_TECHO_REV_1_RST;

      hw_info.revision = 1;
      hw_info.touch    = TOUCH_TTP223;
      break;

    case NRF52_LILYGO_TECHO_REV_2:
    case NRF52_LILYGO_TECHO_PLUS:
      /* Wake up Quectel L76K GNSS */
      digitalWrite(SOC_GPIO_PIN_GNSS_RST, HIGH);
      pinMode(SOC_GPIO_PIN_GNSS_RST, OUTPUT);
      digitalWrite(SOC_GPIO_PIN_GNSS_WKE, HIGH);
      pinMode(SOC_GPIO_PIN_GNSS_WKE, OUTPUT);

      pinMode(SOC_GPIO_LED_TECHO_REV_2_GREEN, OUTPUT);
      pinMode(SOC_GPIO_LED_TECHO_REV_2_RED,   OUTPUT);
      pinMode(SOC_GPIO_LED_TECHO_REV_2_BLUE,  OUTPUT);

      ledOn (SOC_GPIO_LED_TECHO_REV_2_GREEN);
      ledOff(SOC_GPIO_LED_TECHO_REV_2_RED);
      ledOff(SOC_GPIO_LED_TECHO_REV_2_BLUE);

      lmic_pins.rst = SOC_GPIO_PIN_TECHO_REV_2_RST;
#if defined(USE_RADIOLIB)
      lmic_pins.dio[0] = SOC_GPIO_PIN_DIO1; /* reserved for DIO11 of HPD-16E */
#endif /* USE_RADIOLIB */

      hw_info.revision = 2;
      hw_info.touch    = TOUCH_TTP223;
      break;

#if !defined(EXCLUDE_WIP)
    case NRF52_SEEED_WIO_L1:
      /* Wake up Quectel L76K GNSS */
      digitalWrite(SOC_GPIO_PIN_GNSS_L1_WKE, HIGH);
      pinMode(SOC_GPIO_PIN_GNSS_L1_WKE, OUTPUT);

      pinMode(SOC_GPIO_LED_L1_GREEN, OUTPUT);
      // pinMode(SOC_GPIO_LED_L1_BLUE,  OUTPUT);

      digitalWrite(SOC_GPIO_LED_L1_GREEN, LED_STATE_ON);
      // digitalWrite(SOC_GPIO_LED_L1_BLUE,  LED_STATE_ON);

      lmic_pins.nss  = SOC_GPIO_PIN_L1_SS;
      lmic_pins.rst  = SOC_GPIO_PIN_L1_RST;
      lmic_pins.busy = SOC_GPIO_PIN_L1_BUSY;

      hw_info.revision = 3; /* Unknown */
      break;

    case NRF52_SEEED_T2000:
      /* Wake up Quectel L76K GNSS */
      digitalWrite(SOC_GPIO_PIN_GNSS_T2000_WKE, HIGH);
      pinMode(SOC_GPIO_PIN_GNSS_T2000_WKE, OUTPUT);

      pinMode(SOC_GPIO_LED_T2000_GREEN, OUTPUT);
      // pinMode(SOC_GPIO_LED_T2000_BLUE,  OUTPUT);

      digitalWrite(SOC_GPIO_LED_T2000_GREEN, LED_STATE_ON);
      // digitalWrite(SOC_GPIO_LED_T2000_BLUE,  LED_STATE_ON);

      lmic_pins.nss  = SOC_GPIO_PIN_T2000_SS;
      lmic_pins.rst  = SOC_GPIO_PIN_T2000_RST;
      lmic_pins.busy = SOC_GPIO_PIN_T2000_BUSY;

