lyusupov/SoftRF/software/firmware/source/SoftRF/src/platform/nRF52.cpp
      hw_info.revision = 3; /* Unknown */
      break;

    case NRF52_HELTEC_T1:
      /* Power on up UC6580 GNSS */
      digitalWrite(SOC_GPIO_PIN_GNSS_T1_EN, LOW);
      pinMode(SOC_GPIO_PIN_GNSS_T1_EN, OUTPUT);

      pinMode(SOC_GPIO_LED_T1_WHITE, OUTPUT);
      digitalWrite(SOC_GPIO_LED_T1_WHITE, LED_STATE_ON);

      lmic_pins.nss  = SOC_GPIO_PIN_T1_SS;
      lmic_pins.rst  = SOC_GPIO_PIN_T1_RST;
      lmic_pins.busy = SOC_GPIO_PIN_T1_BUSY;

      pinMode(SOC_GPIO_PIN_T1_SENS_INT1, INPUT);
      pinMode(SOC_GPIO_PIN_T1_SENS_INT2, INPUT);

      hw_info.revision = 3; /* Unknown */
      break;

    case NRF52_ELECROW_TN_M8:
      digitalWrite(SOC_GPIO_PIN_GNSS_M8_EN, HIGH);
      pinMode(SOC_GPIO_PIN_GNSS_M8_EN, OUTPUT);

      /* Wake up Quectel L76K GNSS */
      digitalWrite(SOC_GPIO_PIN_GNSS_M8_RST, LOW);
      pinMode(SOC_GPIO_PIN_GNSS_M8_RST, OUTPUT);
      digitalWrite(SOC_GPIO_PIN_GNSS_M8_WKE, HIGH);
      pinMode(SOC_GPIO_PIN_GNSS_M8_WKE, OUTPUT);

      lmic_pins.nss  = SOC_GPIO_PIN_M8_SS;
      lmic_pins.rst  = SOC_GPIO_PIN_M8_RST;
      lmic_pins.busy = SOC_GPIO_PIN_M8_BUSY;

      pinMode(SOC_GPIO_PIN_M8_ANT_SW,   INPUT_PULLUP);

      hw_info.revision = 3; /* Unknown */
      hw_info.audio    = AUDIO_PWM;
      break;
#endif /* EXCLUDE_WIP */

    case NRF52_SEEED_T1000E:
      digitalWrite(SOC_GPIO_PIN_GNSS_T1000_EN, HIGH);
      pinMode(SOC_GPIO_PIN_GNSS_T1000_EN, OUTPUT);

      digitalWrite(SOC_GPIO_PIN_GNSS_T1000_VRTC, HIGH);
      pinMode(SOC_GPIO_PIN_GNSS_T1000_VRTC, OUTPUT);

      digitalWrite(SOC_GPIO_PIN_GNSS_T1000_RST, LOW);
      pinMode(SOC_GPIO_PIN_GNSS_T1000_RST, OUTPUT);

      digitalWrite(SOC_GPIO_PIN_GNSS_T1000_SINT, HIGH);
      pinMode(SOC_GPIO_PIN_GNSS_T1000_SINT, OUTPUT);

      digitalWrite(SOC_GPIO_PIN_GNSS_T1000_RINT, LOW);
      pinMode(SOC_GPIO_PIN_GNSS_T1000_RINT, OUTPUT);

      digitalWrite(SOC_GPIO_LED_T1000_GREEN, LED_STATE_ON);
      pinMode(SOC_GPIO_LED_T1000_GREEN, OUTPUT);

      lmic_pins.nss  = SOC_GPIO_PIN_T1000_SS;
      lmic_pins.rst  = SOC_GPIO_PIN_T1000_RST;
      lmic_pins.busy = SOC_GPIO_PIN_T1000_BUSY;
#if defined(USE_RADIOLIB)
      lmic_pins.dio[0] = SOC_GPIO_PIN_T1000_DIO9; /* LR1110 */
#endif /* USE_RADIOLIB */

      hw_info.revision = 3; /* Unknown */
      hw_info.audio    = AUDIO_PWM;
      break;

    case NRF52_HELTEC_T114:
      digitalWrite(SOC_GPIO_PIN_GNSS_T114_RST, HIGH); /* RESET - LOW */
      pinMode(SOC_GPIO_PIN_GNSS_T114_RST, OUTPUT);
      digitalWrite(SOC_GPIO_PIN_GNSS_T114_WKE, HIGH); /* SLEEP - LOW */
      pinMode(SOC_GPIO_PIN_GNSS_T114_WKE, OUTPUT);

      pinMode(SOC_GPIO_LED_T114_GREEN, OUTPUT);
      ledOn(SOC_GPIO_LED_T114_GREEN);

#if !defined(EXCLUDE_LED_RING)
      T114_Pixels.begin();
      T114_Pixels.show(); // Initialize all pixels to 'off'
#endif /* EXCLUDE_LED_RING */

      lmic_pins.nss  = SOC_GPIO_PIN_T114_SS;
      lmic_pins.rst  = SOC_GPIO_PIN_T114_RST;
      lmic_pins.busy = SOC_GPIO_PIN_T114_BUSY;

      hw_info.revision = 3; /* Unknown */
      break;

    case NRF52_ELECROW_TN_M1:
      /* Wake up Quectel L76K GNSS */
      digitalWrite(SOC_GPIO_PIN_GNSS_M1_RST, HIGH);
      pinMode(SOC_GPIO_PIN_GNSS_M1_RST, OUTPUT);
      digitalWrite(SOC_GPIO_PIN_GNSS_M1_WKE, HIGH);
      pinMode(SOC_GPIO_PIN_GNSS_M1_WKE, OUTPUT);

      digitalWrite(SOC_GPIO_LED_M1_RED_PWR, HIGH);
      pinMode(SOC_GPIO_LED_M1_RED_PWR,      OUTPUT);

      pinMode(SOC_GPIO_LED_M1_RED,  OUTPUT);
      pinMode(SOC_GPIO_LED_M1_BLUE, OUTPUT);

      digitalWrite(SOC_GPIO_LED_M1_RED,    LED_STATE_ON);
      digitalWrite(SOC_GPIO_LED_M1_BLUE, 1-LED_STATE_ON);

      lmic_pins.nss  = SOC_GPIO_PIN_M1_SS;
      lmic_pins.rst  = SOC_GPIO_PIN_M1_RST;
      lmic_pins.busy = SOC_GPIO_PIN_M1_BUSY;

      hw_info.revision = 3; /* Unknown */
      hw_info.audio    = AUDIO_PWM;
      break;

    case NRF52_ELECROW_TN_M3:
      digitalWrite(SOC_GPIO_PIN_GNSS_M3_EN, HIGH);
      pinMode(SOC_GPIO_PIN_GNSS_M3_EN, OUTPUT);
      digitalWrite(SOC_GPIO_PIN_GNSS_M3_RST, LOW);
      pinMode(SOC_GPIO_PIN_GNSS_M3_RST, OUTPUT);
      digitalWrite(SOC_GPIO_PIN_GNSS_M3_WKE, HIGH);
      pinMode(SOC_GPIO_PIN_GNSS_M3_WKE, OUTPUT);

      digitalWrite(SOC_GPIO_LED_M3_RGB_PWR, HIGH);
      pinMode(SOC_GPIO_LED_M3_RGB_PWR,      OUTPUT);

      pinMode(SOC_GPIO_LED_M3_RED,   OUTPUT);
      pinMode(SOC_GPIO_LED_M3_GREEN, OUTPUT);
      pinMode(SOC_GPIO_LED_M3_BLUE,  OUTPUT);

      digitalWrite(SOC_GPIO_LED_M3_RED,   1-LED_STATE_ON);
      digitalWrite(SOC_GPIO_LED_M3_GREEN, LED_STATE_ON);
      digitalWrite(SOC_GPIO_LED_M3_BLUE,  1-LED_STATE_ON);

      lmic_pins.nss  = SOC_GPIO_PIN_M3_SS;
      lmic_pins.rst  = SOC_GPIO_PIN_M3_RST;
      lmic_pins.busy = SOC_GPIO_PIN_M3_BUSY;
#if defined(USE_RADIOLIB)
      lmic_pins.dio[0] = SOC_GPIO_PIN_M3_DIO9; /* LR1110 */
#endif /* USE_RADIOLIB */

      hw_info.revision = 3; /* Unknown */
      hw_info.audio    = AUDIO_PWM;
      break;

    case NRF52_ELECROW_TN_M6:
      digitalWrite(SOC_GPIO_PIN_GNSS_M6_EN, HIGH);
      pinMode(SOC_GPIO_PIN_GNSS_M6_EN, OUTPUT);

      /* Wake up Quectel L76K GNSS */
      digitalWrite(SOC_GPIO_PIN_GNSS_M6_RST, LOW);
      pinMode(SOC_GPIO_PIN_GNSS_M6_RST, OUTPUT);
      digitalWrite(SOC_GPIO_PIN_GNSS_M6_WKE, HIGH);
      pinMode(SOC_GPIO_PIN_GNSS_M6_WKE, OUTPUT);

      pinMode(SOC_GPIO_LED_M6_RED,  OUTPUT);
      pinMode(SOC_GPIO_LED_M6_BLUE, OUTPUT);

      digitalWrite(SOC_GPIO_LED_M6_RED,    LED_STATE_ON);
      digitalWrite(SOC_GPIO_LED_M6_BLUE, 1-LED_STATE_ON);

      lmic_pins.nss  = SOC_GPIO_PIN_M6_SS;
      lmic_pins.rst  = SOC_GPIO_PIN_M6_RST;
      lmic_pins.busy = SOC_GPIO_PIN_M6_BUSY;

      hw_info.revision = 3; /* Unknown */
      break;

    case NRF52_LILYGO_TIMPULSE_PLUS:
      /* Power on u-blox MIA-M10Q GNSS */
      digitalWrite(SOC_GPIO_PIN_GNSS_TIP_PWR, LOW);
      pinMode(SOC_GPIO_PIN_GNSS_TIP_PWR, OUTPUT);

      lmic_pins.nss  = SOC_GPIO_PIN_TIP_SS;
      lmic_pins.rst  = SOC_GPIO_PIN_TIP_RST;
      lmic_pins.busy = SOC_GPIO_PIN_TIP_BUSY;

      lmic_pins.txe  = SOC_GPIO_PIN_TIP_TX_EN;
      lmic_pins.rxe  = SOC_GPIO_PIN_TIP_RX_EN;

      pinMode(SOC_GPIO_PIN_TIP_INT1, INPUT);
      pinMode(SOC_GPIO_PIN_TIP_INT2, INPUT);

