lyusupov/SoftRF/software/firmware/source/SoftRF/src/platform/nRF52.cpp
      hw_info.revision = 3; /* Unknown */
      hw_info.touch    = TOUCH_TTP223;
      break;

    case NRF52_LILYGO_TECHO_CARD:
      digitalWrite(SOC_GPIO_PIN_GNSS_TEC_PWR, LOW);
      pinMode(SOC_GPIO_PIN_GNSS_TEC_PWR, OUTPUT);

      /* Wake up Quectel L76K GNSS */
      digitalWrite(SOC_GPIO_PIN_GNSS_TEC_WKE, HIGH);
      pinMode(SOC_GPIO_PIN_GNSS_TEC_WKE, OUTPUT);
      digitalWrite(SOC_GPIO_PIN_GNSS_TEC_SW, HIGH);
      pinMode(SOC_GPIO_PIN_GNSS_TEC_SW, OUTPUT);

#if !defined(EXCLUDE_LED_RING)
#if 0
      TEC_Pixel1.begin();
      TEC_Pixel1.setPixelColor(0, LED_COLOR_GREEN);
      TEC_Pixel1.show();
      TEC_Pixel2.begin();
      TEC_Pixel2.show(); // Initialize pixel to 'off'
      TEC_Pixel3.begin();
      TEC_Pixel3.show(); // Initialize pixel to 'off'
#else
      T114_Pixels.updateLength(1);
      T114_Pixels.setPin(SOC_GPIO_LED_TEC_LED1);
      T114_Pixels.begin();
      T114_Pixels.setPixelColor(0, LED_COLOR_GREEN);
      T114_Pixels.show();
#endif
#endif /* EXCLUDE_LED_RING */

      lmic_pins.nss  = SOC_GPIO_PIN_TEC_SS;
      lmic_pins.rst  = SOC_GPIO_PIN_TEC_RST;
      lmic_pins.busy = SOC_GPIO_PIN_TEC_BUSY;

      lmic_pins.txe  = SOC_GPIO_PIN_TEC_TX_EN;
      lmic_pins.rxe  = SOC_GPIO_PIN_TEC_RX_EN;

      pinMode(SOC_GPIO_PIN_TEC_INT, INPUT);

      hw_info.revision = 3; /* Unknown */
      break;

    case NRF52_SEEED_X1:
      digitalWrite(SOC_GPIO_PIN_GNSS_X1_EN, HIGH);
      pinMode(SOC_GPIO_PIN_GNSS_X1_EN, OUTPUT);

      digitalWrite(SOC_GPIO_PIN_GNSS_X1_VRTC, HIGH);
      pinMode(SOC_GPIO_PIN_GNSS_X1_VRTC, OUTPUT);

      digitalWrite(SOC_GPIO_PIN_GNSS_X1_RST, LOW);
      pinMode(SOC_GPIO_PIN_GNSS_X1_RST, OUTPUT);

      digitalWrite(SOC_GPIO_PIN_GNSS_X1_SINT, HIGH);
      pinMode(SOC_GPIO_PIN_GNSS_X1_SINT, OUTPUT);

      digitalWrite(SOC_GPIO_PIN_GNSS_X1_RINT, LOW);
      pinMode(SOC_GPIO_PIN_GNSS_X1_RINT, OUTPUT);

      digitalWrite(SOC_GPIO_LED_X1_RED,  1-LED_STATE_ON);
      digitalWrite(SOC_GPIO_LED_X1_GREEN,  LED_STATE_ON);
      digitalWrite(SOC_GPIO_LED_X1_BLUE, 1-LED_STATE_ON);

      pinMode(SOC_GPIO_LED_X1_RED,   OUTPUT);
      pinMode(SOC_GPIO_LED_X1_GREEN, OUTPUT);
      pinMode(SOC_GPIO_LED_X1_BLUE,  OUTPUT);

      lmic_pins.nss  = SOC_GPIO_PIN_X1_SS;
      lmic_pins.rst  = SOC_GPIO_PIN_X1_RST;
      lmic_pins.busy = SOC_GPIO_PIN_X1_BUSY;
#if defined(USE_RADIOLIB)
      lmic_pins.dio[0] = SOC_GPIO_PIN_X1_DIO8; /* LR2021 */
#endif /* USE_RADIOLIB */

      hw_info.revision = 3; /* Unknown */
      hw_info.audio    = AUDIO_PWM;
      break;

    case NRF52_NORDIC_PCA10059:
    default:
      pinMode(SOC_GPIO_LED_PCA10059_STATUS, OUTPUT);
      pinMode(SOC_GPIO_LED_PCA10059_GREEN,  OUTPUT);
      pinMode(SOC_GPIO_LED_PCA10059_RED,    OUTPUT);
      pinMode(SOC_GPIO_LED_PCA10059_BLUE,   OUTPUT);

      ledOn (SOC_GPIO_LED_PCA10059_GREEN);
      ledOff(SOC_GPIO_LED_PCA10059_RED);
      ledOff(SOC_GPIO_LED_PCA10059_BLUE);
      ledOff(SOC_GPIO_LED_PCA10059_STATUS);

      hw_info.revision = 3; /* Unknown */
      break;
  }

#if !defined(ARDUINO_ARCH_MBED) && !defined(ARDUINO_ARCH_ZEPHYR)
  if (nRF52_board == NRF52_SEEED_X1) {
    if (nRF52_has_rtc) {
//    rtc_2 = new RTC_RX8900_U(&Wire1);
//    if (rtc_2->begin())
      {
        pinMode(SOC_GPIO_PIN_X1_RTC_INT,INPUT);
        hw_info.rtc = RTC_YSN8900;
      }
    }
  } else {
    i2c = new I2CBus(Wire);

    if (nRF52_has_rtc && (i2c != nullptr)) {
      rtc = new PCF8563_Class(*i2c);

      switch (nRF52_board)
      {
        case NRF52_HELTEC_T114:
          pinMode(SOC_GPIO_PIN_T114_R_INT, INPUT);
          break;
        case NRF52_ELECROW_TN_M3:
          // pinMode(SOC_GPIO_PIN_RTC_M3_INT, INPUT);
          break;
        case NRF52_ELECROW_TN_M6:
          pinMode(SOC_GPIO_PIN_RTC_M6_INT, INPUT);
          break;
        case NRF52_ELECROW_TN_M8:
          /* TBD */
          break;
        case NRF52_LILYGO_TECHO_REV_0:
        case NRF52_LILYGO_TECHO_REV_1:
        case NRF52_LILYGO_TECHO_REV_2:
        case NRF52_LILYGO_TECHO_PLUS:
        case NRF52_ELECROW_TN_M1:
        case NRF52_NORDIC_PCA10059:
        default:
          pinMode(SOC_GPIO_PIN_R_INT, INPUT);
          break;
      }

      hw_info.rtc = RTC_PCF8563;
    }
  }
#endif /* ARDUINO_ARCH_MBED */

#if !defined(EXCLUDE_IMU)
  if (nRF52_has_imu) {
    switch (nRF52_board)
    {
      case NRF52_LILYGO_TECHO_REV_2:
      case NRF52_LILYGO_TECHO_PLUS:
      case NRF52_LILYGO_TECHO_CARD:
        Wire.begin();

        if (imu_1.setup(MPU9250_ADDRESS)) {
          imu_1.verbose(false);
          if (imu_1.isSleeping()) {
            imu_1.sleep(false);
          }
          hw_info.imu = IMU_MPU9250;
          hw_info.mag = MAG_AK8963;
          IMU_Time_Marker = millis();
#if !defined(EXCLUDE_BHI260)
        } else if (
#if defined(USE_BHI260_RAM_FW)
                   imu_4.setFirmware(bosch_firmware_image,
                                     bosch_firmware_size,
                                     bosch_firmware_type),
#endif /* USE_BHI260_RAM_FW */
                   imu_4.begin(Wire, BHI260AP_ADDRESS_L,
                                     SOC_GPIO_PIN_SDA, SOC_GPIO_PIN_SCL)) {
          float sample_rate = 12.5;
          uint32_t report_latency_ms = 0; /* Report immediately */

          // Enable acceleration
          bhi_accel.enable(sample_rate, report_latency_ms);
          // Enable gyroscope
          // bhi_gyro.enable(sample_rate, report_latency_ms);

          hw_info.imu = IMU_BHI260AP;
          IMU_Time_Marker = millis();
#endif /* EXCLUDE_BHI260 */
        } else {
          bool ad0 = (ICM20948_ADDRESS == 0x69) ? true : false;

          for (int t=0; t<3; t++) {
            if (imu_2.begin(Wire, ad0) == ICM_20948_Stat_Ok) {
              hw_info.imu = IMU_ICM20948;
              hw_info.mag = MAG_AK09916;
              IMU_Time_Marker = millis();

              break;
            }
            delay(IMU_UPDATE_INTERVAL);
          }
        }
        break;

#if !defined(EXCLUDE_WIP)
      case NRF52_HELTEC_T1:
        /* TBD */
        break;
#endif /* EXCLUDE_WIP */

