lyusupov/SoftRF/software/firmware/source/SoftRF/src/platform/nRF52.cpp
      case NRF52_SEEED_T1000E:
        Wire.begin();

        if (imu_3.begin()) {
          imu_3.softwareReset();
          delay(5);
          imu_3.setRange(SFE_QMA6100P_RANGE4G);
          imu_3.enableAccel(true);
          imu_3.calibrateOffsets();
          // imu_3.setOffset();

          hw_info.imu     = ACC_QMA6100P;
          IMU_Time_Marker = millis();
        }
        break;

      case NRF52_ELECROW_TN_M3:
      case NRF52_ELECROW_TN_M8:
        Wire.begin();
        imu_5 = Adafruit_LIS3DH(&Wire);
        if (imu_5.begin(SC7A20H_ADDRESS_H, 0x11)) {
          imu_5.setRange(LIS3DH_RANGE_4_G);

          hw_info.imu     = ACC_SC7A20H;
          IMU_Time_Marker = millis();
        }
        break;

      case NRF52_LILYGO_TIMPULSE_PLUS:
        Wire1.begin();
        {
          bool ad0 = (ICM20948_ADDRESS_ALT == 0x69) ? true : false;

          for (int t=0; t<3; t++) {
            if (imu_2.begin(Wire1, ad0) == ICM_20948_Stat_Ok) {
              hw_info.imu = IMU_ICM20948;
              hw_info.mag = MAG_AK09916;
              IMU_Time_Marker = millis();

              break;
            }
            delay(IMU_UPDATE_INTERVAL);
          }
        }
        break;

      default:
        break;
    }
  }
#endif /* EXCLUDE_IMU */

#if !defined(ARDUINO_ARCH_MBED) && !defined(ARDUINO_ARCH_ZEPHYR)
  if (nRF52_has_spiflash) {
    spiflash_id = SPIFlash->getJEDECID();

    //mx25_status_config[0] = SPIFlash->readStatus();
    //HWFlashTransport.readCommand(SFLASH_CMD_READ_CONFIG,   mx25_status_config + 1, 2);
    //mx25_status_config[2] |= 0x2;       /* High performance mode */
    //SPIFlash->writeEnable();
    //HWFlashTransport.writeCommand(SFLASH_CMD_WRITE_STATUS, mx25_status_config,     3);
    //SPIFlash->writeDisable();
    //SPIFlash->waitUntilReady();

    //uint32_t const wr_speed = min(80 * 1000000U, (uint32_t)F_CPU);
    //uint32_t rd_speed = wr_speed;
    //HWFlashTransport.setClockSpeed(wr_speed, rd_speed);

    // Set disk vendor id, product id and revision with string up to 8, 16, 4 characters respectively
    usb_msc.setID(nRF5x_Device_Manufacturer, "External Flash", "1.0");

    // Set callback
    usb_msc.setReadWriteCallback(nRF52_msc_read_cb,
                                 nRF52_msc_write_cb,
                                 nRF52_msc_flush_cb);

    // Set disk size, block size should be 512 regardless of spi flash page size
    usb_msc.setCapacity(SPIFlash->size()/512, 512);

    // MSC is ready for read/write
    usb_msc.setUnitReady(true);

    usb_msc.begin();

    FATFS_is_mounted = fatfs.begin(SPIFlash);
  }
#endif /* ARDUINO_ARCH_MBED */

#if defined(USE_USB_MIDI)
  // Initialize MIDI with no any input channels
  // This will also call usb_midi's begin()
  MIDI_USB.begin(MIDI_CHANNEL_OFF);
#endif /* USE_USB_MIDI */

  Serial.begin(SERIAL_OUT_BR, SERIAL_OUT_BITS);

#if defined(USE_TINYUSB) && defined(USBCON)
  for (int i=0; i < 20; i++) {if (Serial) break; else delay(100);}
#endif

#if !defined(EXCLUDE_WIFI)
  switch (nRF52_board)
  {
    case NRF52_LILYGO_TECHO_REV_0:
    case NRF52_LILYGO_TECHO_REV_1:
    case NRF52_LILYGO_TECHO_REV_2:
    case NRF52_LILYGO_TECHO_PLUS:
    case NRF52_NORDIC_PCA10059:
    default:
#if defined(_WIFI_ESP_AT_H_)
      Serial1.begin(115200);
      WiFi.init(&Serial1);
#endif /* _WIFI_ESP_AT_H_ */

#if defined(WiFiNINA_h)
      WiFi.setPins(SPIWIFI_SS, SPIWIFI_ACK, ESP32_RESETN, ESP32_GPIO0, &SPIWIFI);
#endif /* WiFiNINA_h */
      break;
  }
#endif /* EXCLUDE_WIFI */

#if defined(ENABLE_NFC)
  if (nRF52_board == NRF52_LILYGO_TECHO_REV_0 ||
      nRF52_board == NRF52_LILYGO_TECHO_REV_1 ||
      nRF52_board == NRF52_LILYGO_TECHO_REV_2) {
    if ((NRF_UICR->NFCPINS & UICR_NFCPINS_PROTECT_Msk) != (UICR_NFCPINS_PROTECT_NFC << UICR_NFCPINS_PROTECT_Pos)) {
      Serial.println("*** NFC pins are disabled ***");
      // nfcpins_enable();
    }
  }
#endif /* ENABLE_NFC */

  if (nRF52_board == NRF52_LILYGO_TECHO_PLUS) {
#if SENSORLIB_VERSION == SENSORLIB_VERSION_VAL(0, 3, 1)
    nRF52_has_vibra = vibra.begin(Wire);
#endif /* (0, 3, 1) */
#if SENSORLIB_VERSION >= SENSORLIB_VERSION_VAL(0, 4, 1)
    nRF52_has_vibra = vibra.begin(Wire, DRV2605_SLAVE_ADDRESS);
#endif /* (0, 4, 1) */

    if (nRF52_has_vibra) {
      vibra.selectLibrary(1);
#if SENSORLIB_VERSION == SENSORLIB_VERSION_VAL(0, 3, 1)
      vibra.setMode(SensorDRV2605::MODE_INTTRIG);
#endif /* (0, 3, 1) */
#if SENSORLIB_VERSION >= SENSORLIB_VERSION_VAL(0, 4, 1)
      vibra.setMode(HapticMode::INTERNAL_TRIGGER);
#endif /* (0, 4, 1) */

      digitalWrite(SOC_GPIO_PIN_MOTOR_EN, HIGH);
      pinMode(SOC_GPIO_PIN_MOTOR_EN, OUTPUT);
      hw_info.haptic = HAPTIC_DRV2605;
    }
    hw_info.audio = AUDIO_PWM;
  }

  if (nRF52_board == NRF52_SEEED_X1) {
#if SENSORLIB_VERSION == SENSORLIB_VERSION_VAL(0, 3, 1)
    nRF52_has_vibra = vibra.begin(Wire);
#endif /* (0, 3, 1) */
#if SENSORLIB_VERSION >= SENSORLIB_VERSION_VAL(0, 4, 1)
    nRF52_has_vibra = vibra.begin(Wire, DRV2605_SLAVE_ADDRESS);
#endif /* (0, 4, 1) */

    if (nRF52_has_vibra) {
      vibra.selectLibrary(1);
#if SENSORLIB_VERSION == SENSORLIB_VERSION_VAL(0, 3, 1)
      vibra.setMode(SensorDRV2605::MODE_INTTRIG);
#endif /* (0, 3, 1) */
#if SENSORLIB_VERSION >= SENSORLIB_VERSION_VAL(0, 4, 1)
      vibra.setMode(HapticMode::INTERNAL_TRIGGER);
#endif /* (0, 4, 1) */

      hw_info.haptic = HAPTIC_DRV2605;
    }

    pinMode(SOC_GPIO_PIN_X1_BUZZER, INPUT_PULLDOWN);

    Wire.beginTransmission(BMM350_ADDRESS);
    if (Wire.endTransmission() == 0) {
      hw_info.mag = MAG_BMM350;
    }
  }

  if (nRF52_board == NRF52_LILYGO_TIMPULSE_PLUS) {
#if !defined(EXCLUDE_IMU)
    if (nRF52_has_imu == false)
#endif
    {
      Wire1.begin();
    }
    if (initSGM41562(Wire1)) {
      hw_info.pmu = BMU_SGM41562;
    }
  }
}

static void nRF52_post_init()
{
  uint32_t variant = NRF_FICR->INFO.VARIANT;
  char bc_high     = (variant >> 8) & 0xFF;
  char bc_low      = (variant     ) & 0xFF;
  const char *rev  = "UNKNOWN";

  switch (bc_high)
  {
    case 'A': rev = "Engineering A"; break;
    case 'B': rev = "Engineering B"; break;
    case 'C':
      if (bc_low == 'A')
              rev = "Engineering C";
      else
              rev = "1";
      break;
    case 'D':
      if (bc_low == 'A')
              rev = "Engineering D";
      else
              rev = "2";
      break;
    case 'F': rev = "3";             break;
    default:                         break;
  }

