lyusupov/SoftRF/software/firmware/source/SoftRF/src/platform/nRF52.cpp
#if 0
  Serial.println();
  Serial.print  (F("MCU Revision: "));
  Serial.println(rev);
#endif

  if (nRF52_board == NRF52_LILYGO_TECHO_REV_0 ||
      nRF52_board == NRF52_LILYGO_TECHO_REV_1 ||
      nRF52_board == NRF52_LILYGO_TECHO_REV_2 ||
      nRF52_board == NRF52_LILYGO_TECHO_PLUS  ||
      nRF52_board == NRF52_LILYGO_TECHO_CARD  ||
      nRF52_board == NRF52_ELECROW_TN_M1      ||
      nRF52_board == NRF52_LILYGO_TIMPULSE_PLUS) {

#if 0
    char strbuf[32];
    Serial.println();
    Serial.print  (F("64-bit Device ID: "));
    snprintf(strbuf, sizeof(strbuf),"0x%08x%08x", DEVICE_ID_HIGH, DEVICE_ID_LOW);
    Serial.println(strbuf);
#endif

#if 0
    Serial.println();
    Serial.print  (F("SPI FLASH JEDEC ID: "));
    Serial.print  (spiflash_id, HEX);           Serial.print(" ");
    Serial.print  (F("STATUS/CONFIG: "));
    Serial.print  (mx25_status_config[0], HEX); Serial.print(" ");
    Serial.print  (mx25_status_config[1], HEX); Serial.print(" ");
    Serial.print  (mx25_status_config[2], HEX); Serial.println();
#endif

    Serial.println();
    Serial.print  (nRF52_board == NRF52_ELECROW_TN_M1  ? F("Elecrow ") : F("LilyGO T-"));
    Serial.print  (nRF52_board == NRF52_ELECROW_TN_M1  ? F("TN-M1") :
                   nRF52_board == NRF52_LILYGO_TIMPULSE_PLUS ? F("Impulse Plus") :
                   F("Echo"));
    Serial.print  (F(" ("));
    Serial.print  (nRF52_board == NRF52_LILYGO_TECHO_CARD ? "Card" :
                   hw_info.revision > 2 ?
                   Hardware_Rev[3] : Hardware_Rev[hw_info.revision]);
    Serial.println(F(") Power-on Self Test"));
    Serial.println();
    Serial.flush();

    Serial.println(F("Built-in components:"));

    Serial.print(F("RADIO   : "));
    Serial.println(hw_info.rf      == RF_IC_SX1262 ||
                   hw_info.rf      == RF_IC_SX1276 ||
                   hw_info.rf      == RF_IC_LR1110 ||
                   hw_info.rf      == RF_IC_LR1121     ? F("PASS") : F("FAIL"));
    Serial.flush();
    Serial.print(F("GNSS    : "));
    if (nRF52_board == NRF52_LILYGO_TIMPULSE_PLUS) {
      Serial.println(hw_info.gnss  == GNSS_MODULE_U10  ? F("PASS") : F("FAIL"));
    } else if (nRF52_board == NRF52_LILYGO_TECHO_REV_0 ||
               nRF52_board == NRF52_LILYGO_TECHO_REV_1) {
      Serial.println(hw_info.gnss  == GNSS_MODULE_GOKE ? F("PASS") : F("FAIL"));
    } else {
      Serial.println(hw_info.gnss  == GNSS_MODULE_AT65 ? F("PASS") : F("FAIL"));
    }
    Serial.flush();
    Serial.print(F("DISPLAY : "));
    Serial.println(hw_info.display == DISPLAY_EPD_1_54  ||
                   hw_info.display == DISPLAY_OLED_0_49 ||
                   hw_info.display == DISPLAY_EPD_3_71 ? F("PASS") : F("FAIL"));
    Serial.flush();
    if (nRF52_board == NRF52_LILYGO_TIMPULSE_PLUS ||
        nRF52_board == NRF52_LILYGO_TECHO_CARD) {
      Serial.print(F("IMU     : "));
      Serial.println(hw_info.imu   == IMU_ICM20948     ? F("PASS") : F("FAIL"));
     if (nRF52_board == NRF52_LILYGO_TIMPULSE_PLUS) {
      Serial.print(F("BMU     : "));
      Serial.println(hw_info.pmu   == BMU_SGM41562     ? F("PASS") : F("FAIL"));
      Serial.flush();
     }
    } else {
      Serial.print(F("RTC     : "));
      Serial.println(hw_info.rtc   == RTC_PCF8563      ? F("PASS") : F("FAIL"));
      Serial.flush();
    }

    Serial.print(F("FLASH   : "));
    Serial.println(hw_info.storage == STORAGE_FLASH_AND_CARD ||
                   hw_info.storage == STORAGE_FLASH    ? F("PASS") : F("FAIL"));
    Serial.flush();

    if (nRF52_board == NRF52_LILYGO_TECHO_REV_1 ||
        nRF52_board == NRF52_LILYGO_TECHO_REV_2 ||
        nRF52_board == NRF52_LILYGO_TECHO_PLUS) {
      Serial.print(F("BMx280  : "));
      Serial.println(hw_info.baro == BARO_MODULE_BMP280 ? F("PASS") : F("N/A"));
      Serial.flush();
#if !defined(EXCLUDE_IMU)
      Serial.println();
      Serial.println(F("External components:"));
      Serial.print(F("IMU     : "));
      Serial.println(hw_info.imu  == IMU_MPU9250  ||
                     hw_info.imu  == IMU_ICM20948 ||
                     hw_info.imu  == IMU_BHI260AP       ? F("PASS") : F("N/A"));
      Serial.flush();
#endif /* EXCLUDE_IMU */
    }

    Serial.println();
    Serial.println(F("Power-on Self Test is complete."));
    Serial.println();
    Serial.flush();

#if 0
    if (nRF52_board == NRF52_LILYGO_TECHO_CARD) {
#if defined(USE_EXT_I2S_DAC)
      char filename[MAX_FILENAME_LEN];
      strcpy(filename, WAV_FILE_PREFIX);
      strcat(filename, "POST");
      strcat(filename, WAV_FILE_SUFFIX);
      if (FATFS_is_mounted && fatfs.exists(filename)) {
        play_file(filename);
      }
#endif /* USE_EXT_I2S_DAC */
    }
#endif

#if defined(ENABLE_NFC) && defined(EXCLUDE_BLUETOOTH)
    if ((NRF_UICR->NFCPINS & UICR_NFCPINS_PROTECT_Msk) == (UICR_NFCPINS_PROTECT_NFC << UICR_NFCPINS_PROTECT_Pos)) {
      String NFC_name = SOFTRF_IDENT;
      char id_06x[8];
      snprintf(id_06x, sizeof(id_06x),"%06x", SoC->getChipId() & 0x00FFFFFFU);
      NFC_name += "-";
      NFC_name += String(id_06x);

      NFC.setTXTmessage((NFC_name+"-NFC").c_str(), "en");
      NFC.start();
      NFC.registerCallback(nfc_func);
    }
#endif /* ENABLE_NFC */

#if 0
    if (nRF52_board == NRF52_LILYGO_TECHO_PLUS) {
      BoschSensorInfo info = imu_4.getSensorInfo();
      info.printInfo(Serial);
      Serial.flush();
    }
#endif
  } else if (nRF52_board == NRF52_HELTEC_T114) {
    Serial.println();
    Serial.println(F("Heltec T114 Power-on Self Test"));
    Serial.println();
    Serial.flush();

    Serial.println(F("Built-in components:"));

    Serial.print(F("RADIO   : "));
    Serial.println(hw_info.rf      == RF_IC_SX1262     ? F("PASS") : F("FAIL"));
    Serial.flush();

    Serial.println();
    Serial.println(F("External components:"));

    Serial.print(F("DISPLAY : "));
    Serial.println(hw_info.display == DISPLAY_TFT_TTGO_135
                                                       ? F("PASS") : F("N/A"));
    Serial.flush();
    Serial.print(F("GNSS    : "));
    Serial.println(hw_info.gnss    != GNSS_MODULE_NONE ? F("PASS") : F("N/A"));
    Serial.flush();
    Serial.print(F("BARO    : "));
    Serial.println(hw_info.baro    != BARO_MODULE_NONE ? F("PASS") : F("N/A"));
    Serial.flush();

    Serial.println();
    Serial.println(F("Power-on Self Test is complete."));
    Serial.println();
    Serial.flush();

  } else if (nRF52_board == NRF52_SEEED_T1000E ||
             nRF52_board == NRF52_SEEED_X1) {
#if 0
    Serial.println();
    Serial.print  (F("SPI FLASH JEDEC ID: "));
    Serial.print  (spiflash_id, HEX);           Serial.print(" ");
#endif

    Serial.println();
    Serial.print  (F("Seeed "));
    Serial.print  (nRF52_board == NRF52_SEEED_X1 ? F("X1") : F("T1000-E"));
    Serial.println(F(" Power-on Self Test"));
    Serial.println();
    Serial.flush();

