lyusupov/SoftRF/software/firmware/source/SoftRF/src/platform/nRF52.cpp
    Serial.println(F("Built-in components:"));

    Serial.print(F("RADIO   : "));
    Serial.println(hw_info.rf    == RF_IC_LR1110 ||
                   hw_info.rf    == RF_IC_LR2021     ? F("PASS") : F("FAIL"));
    Serial.flush();
    Serial.print(F("GNSS    : "));
    Serial.println(hw_info.gnss  == GNSS_MODULE_AG33 ? F("PASS") : F("FAIL"));
    Serial.flush();
    Serial.print(F("FLASH   : "));
    Serial.println(hw_info.storage == STORAGE_FLASH  ? F("PASS") : F("FAIL"));
    Serial.flush();

    if (nRF52_board == NRF52_SEEED_T1000E) {
#if !defined(EXCLUDE_IMU)
      Serial.print(F("IMU     : "));
      Serial.println(hw_info.imu   == ACC_QMA6100P   ? F("PASS") : F("FAIL"));
      Serial.flush();
#endif /* EXCLUDE_IMU */

#if !defined(ARDUINO_ARCH_MBED) && !defined(ARDUINO_ARCH_ZEPHYR)
      analogReference(AR_INTERNAL_3_0);
      analogReadResolution(10);
      delay(1);

      Serial.print(F("TEMP    : "));
      Serial.print((float) t1000e_ntc_sample() / 10.0f);
      Serial.println(F(" Celsius"));
      Serial.print(F("LIGHT   : "));
      Serial.print(t1000e_lux_sample());
      Serial.println(F(" %"));
      Serial.print(F("BATTERY : "));
      Serial.print(t1000e_bat_sample());
      Serial.println(F(" %"));
      Serial.flush();
#endif /* !MBED && !ZEPHYR */
    } else {
      Serial.print(F("BARO    : "));
      Serial.println(hw_info.baro  != BARO_MODULE_NONE ? F("PASS") : F("FAIL"));
      Serial.flush();
    }

    Serial.println();
    Serial.println(F("Power-on Self Test is complete."));
    Serial.println();
    Serial.flush();

  } else if (nRF52_board == NRF52_ELECROW_TN_M3) {

    Serial.println();
    Serial.println(F("Elecrow ThinkNode-M3 Power-on Self Test"));
    Serial.println();
    Serial.flush();

    Serial.println(F("Built-in components:"));

    Serial.print(F("RADIO   : "));
    Serial.println(hw_info.rf    == RF_IC_LR1110     ? F("PASS") : F("FAIL"));
    Serial.flush();
    Serial.print(F("GNSS    : "));
    Serial.println(hw_info.gnss  == GNSS_MODULE_AT65 ? F("PASS") : F("FAIL"));
    Serial.flush();
    Serial.print(F("RTC     : "));
    Serial.println(hw_info.rtc   == RTC_PCF8563      ? F("PASS") : F("FAIL"));
    Serial.flush();

#if !defined(EXCLUDE_IMU)
    Serial.print(F("IMU     : "));
    Serial.println(hw_info.imu   == ACC_SC7A20H      ? F("PASS") : F("FAIL"));
    Serial.flush();
#endif /* EXCLUDE_IMU */

    aht20.begin();
    float humidity, temperature;

    if (aht20.getSensor(&humidity, &temperature)) {
      Serial.print(F("TEMP    : "));
      Serial.print(temperature);
      Serial.println(F(" degrees Celsius"));
      Serial.print(F("HUMID   : "));
      Serial.print(humidity*100);
      Serial.println(F(" % rH"));
      Serial.flush();
    }

    Serial.println();
    Serial.println(F("Power-on Self Test is complete."));
    Serial.println();
    Serial.flush();

  } else if (nRF52_board == NRF52_ELECROW_TN_M6) {
#if 0
    Serial.println();
    Serial.print  (F("SPI FLASH JEDEC ID: "));
    Serial.print  (spiflash_id, HEX);           Serial.print(" ");
#endif

    Serial.println();
    Serial.println(F("Elecrow ThinkNode-M6 Power-on Self Test"));
    Serial.println();
    Serial.flush();

    Serial.println(F("Built-in components:"));

    Serial.print(F("RADIO   : "));
    Serial.println(hw_info.rf    == RF_IC_SX1262     ? F("PASS") : F("FAIL"));
    Serial.flush();
    Serial.print(F("GNSS    : "));
    Serial.println(hw_info.gnss  == GNSS_MODULE_AT65 ? F("PASS") : F("FAIL"));
    Serial.flush();
    Serial.print(F("RTC     : "));
    Serial.println(hw_info.rtc   == RTC_PCF8563      ? F("PASS") : F("FAIL"));
    Serial.flush();
    Serial.print(F("FLASH   : "));
    Serial.println(hw_info.storage == STORAGE_FLASH  ? F("PASS") : F("N/A"));
    Serial.flush();

    Serial.println();
    Serial.println(F("External components:"));

#if defined(USE_OLED)
    Serial.print(F("DISPLAY : "));
    Serial.println(hw_info.display != DISPLAY_NONE   ? F("PASS") : F("N/A"));
    Serial.flush();
#endif /* USE_OLED */

    Serial.print(F("BARO    : "));
    Serial.println(hw_info.baro  != BARO_MODULE_NONE ? F("PASS") : F("N/A"));
    Serial.flush();

    Serial.println();
    Serial.println(F("Power-on Self Test is complete."));
    Serial.println();
    Serial.flush();

  } else if (nRF52_board == NRF52_NORDIC_PCA10059) {
    Serial.println();
    Serial.println(F("Board: Nordic PCA10059 USB Dongle"));
    Serial.println();
    Serial.flush();
  }

  Serial.println(F("Data output device(s):"));

  Serial.print(F("NMEA   - "));
  switch (settings->nmea_out)
  {
    case NMEA_UART       :  Serial.println(F("UART"));          break;
    case NMEA_USB        :  Serial.println(F("USB CDC"));       break;
    case NMEA_BLUETOOTH  :  Serial.println(F("Bluetooth LE"));  break;
    case NMEA_OFF        :
    default              :  Serial.println(F("NULL"));          break;
  }

  Serial.print(F("GDL90  - "));
  switch (settings->gdl90)
  {
    case GDL90_UART      :  Serial.println(F("UART"));          break;
    case GDL90_USB       :  Serial.println(F("USB CDC"));       break;
    case GDL90_BLUETOOTH :  Serial.println(F("Bluetooth LE"));  break;
    case GDL90_OFF       :
    default              :  Serial.println(F("NULL"));          break;
  }

  Serial.print(F("D1090  - "));
  switch (settings->d1090)
  {
    case D1090_UART      :  Serial.println(F("UART"));          break;
    case D1090_USB       :  Serial.println(F("USB CDC"));       break;
    case D1090_BLUETOOTH :  Serial.println(F("Bluetooth LE"));  break;
    case D1090_OFF       :
    default              :  Serial.println(F("NULL"));          break;
  }

  Serial.println();
  Serial.flush();

#if defined(USE_EPAPER)
  if (nRF52_board == NRF52_LILYGO_TECHO_REV_0 ||
      nRF52_board == NRF52_LILYGO_TECHO_REV_1 ||
      nRF52_board == NRF52_LILYGO_TECHO_REV_2 ||
      nRF52_board == NRF52_LILYGO_TECHO_PLUS  ||
      nRF52_board == NRF52_ELECROW_TN_M1      ||
      nRF52_board == NRF52_ELECROW_TN_M8) {
    /* EPD back light on */
    uint8_t bl_state = digitalRead(SOC_GPIO_PIN_EPD_BLGT);
    if (bl_state == LOW) digitalWrite(SOC_GPIO_PIN_EPD_BLGT, HIGH);

    EPD_info1();

    /* EPD back light off */
    if (bl_state == LOW) digitalWrite(SOC_GPIO_PIN_EPD_BLGT, LOW);

    char key[8];
    char out[64];
    uint8_t tokens[3] = { 0 };
    cdbResult rt;
    int c, i = 0, token_cnt = 0;

