lyusupov/SoftRF/software/firmware/source/SoftRF/src/platform/nRF52.cpp
    int acfts;
    char *reg, *mam, *cn;
    reg = mam = cn = NULL;

    if (ADB_is_open) {
      acfts = ucdb.recordsNumber();

      snprintf(key, sizeof(key),"%06X", ThisAircraft.addr);

      rt = ucdb.findKey(key, strlen(key));

      switch (rt) {
        case KEY_FOUND:
          while ((c = ucdb.readValue()) != -1 && i < (sizeof(out) - 1)) {
            if (c == '|') {
              if (token_cnt < (sizeof(tokens) - 1)) {
                token_cnt++;
                tokens[token_cnt] = i+1;
              }
              c = 0;
            }
            out[i++] = (char) c;
          }
          out[i] = 0;

          reg = out + tokens[1];
          mam = out + tokens[0];
          cn  = out + tokens[2];

          break;

        case KEY_NOT_FOUND:
        default:
          break;
      }

      reg = (reg != NULL) && strlen(reg) ? reg : (char *) "REG: N/A";
      mam = (mam != NULL) && strlen(mam) ? mam : (char *) "M&M: N/A";
      cn  = (cn  != NULL) && strlen(cn)  ? cn  : (char *) "N/A";

    } else {
      acfts = -1;
    }

    EPD_info2(acfts, reg, mam, cn);
  }
#endif /* USE_EPAPER */

#if defined(USE_OLED)
  if (hw_info.display == DISPLAY_OLED_1_3  ||
#if !defined(EXCLUDE_OLED_049)
      hw_info.display == DISPLAY_OLED_0_49 ||
#endif /* EXCLUDE_OLED_049 */
      hw_info.display == DISPLAY_OLED_TTGO) {
    OLED_info1();
  }
#endif /* USE_OLED */
}

static void nRF52_loop()
{
#if !defined(ARDUINO_ARCH_MBED) && !defined(ARDUINO_ARCH_ZEPHYR)
  // Reload the watchdog
  if (nrf_wdt_started(NRF_WDT)) {
    Watchdog.reset();
  }

  if (!RTC_sync) {
    if (rtc &&
        gnss.date.isValid()                         &&
        gnss.time.isValid()                         &&
        gnss.date.year() >= fw_build_date_time.year &&
        gnss.date.year() <  fw_build_date_time.year + 15 ) {
      rtc->setDateTime(gnss.date.year(),   gnss.date.month(),
                       gnss.date.day(),    gnss.time.hour(),
                       gnss.time.minute(), gnss.time.second());
      RTC_sync = true;
    }
  }
#endif /* ARDUINO_ARCH_MBED */

#if defined(USE_WEBUSB_SETTINGS) && !defined(USE_WEBUSB_SERIAL)

  if (USBDevice.mounted() && usb_web.connected() && usb_web.available()) {

    JsonObject &root = nRF52_jsonBuffer.parseObject(usb_web);

    if (root.success()) {
      JsonVariant msg_class = root["class"];

      if (msg_class.success()) {
        const char *msg_class_s = msg_class.as<char*>();

        if (!strcmp(msg_class_s,"SOFTRF")) {
          parseSettings  (root);
          parseUISettings(root);

          SoC->WDT_fini();
          if (SoC->Bluetooth_ops) { SoC->Bluetooth_ops->fini(); }
          Serial.println();
          Serial.println(F("Restart is in progress. Please, wait..."));
          Serial.println();
          Serial.flush();
#if !defined(EXCLUDE_EEPROM)
          EEPROM_store();
#endif /* EXCLUDE_EEPROM */
          RF_Shutdown();
          SoC->reset();
        }
      }
    }
  }

#endif /* USE_WEBUSB_SETTINGS */

#if !defined(EXCLUDE_IMU)
  if ((millis() - IMU_Time_Marker) > IMU_UPDATE_INTERVAL) {
    float a_x = 0;
    float a_y = 0;
    float a_z = 0;

    switch (hw_info.imu)
    {
      case IMU_MPU9250:
        if (imu_1.update()) {
          a_x = imu_1.getAccX();
          a_y = imu_1.getAccY();
          a_z = imu_1.getAccZ();
        }
        break;

      case IMU_ICM20948:
        if (imu_2.dataReady()) {
          imu_2.getAGMT();

          // milli g's
          a_x = imu_2.accX() / 1000;
          a_y = imu_2.accY() / 1000;
          a_z = imu_2.accZ() / 1000;
        }
        break;

      case ACC_QMA6100P:
        {
          outputData data;

          imu_3.getAccelData(&data);
          imu_3.offsetValues(data.xData, data.yData, data.zData);

          a_x = data.xData;
          a_y = data.yData;
          a_z = data.zData;
        }
        break;

#if 0 /* TODO */ // !defined(EXCLUDE_BHI260)
      case IMU_BHI260AP:
        imu_4.update();

        if (bhi_accel.hasUpdated()) {
          a_x = bhi_accel.getX(); /* TBD */
          a_y = bhi_accel.getY(); /* TBD */
          a_z = bhi_accel.getZ(); /* TBD */
        }
        break;
#endif /* EXCLUDE_BHI260 */

      case ACC_SC7A20H:
        imu_5.read();
        a_x = imu_5.x_g;
        a_y = imu_5.y_g;
        a_z = imu_5.z_g;
        break;

      default:
        break;
    }

#if 0
    Serial.print("{ACCEL: ");
    Serial.print(a_x);
    Serial.print(",");
    Serial.print(a_y);
    Serial.print(",");
    Serial.print(a_z);
    Serial.println("}");
#endif

    IMU_g = sqrtf(a_x*a_x + a_y*a_y + a_z*a_z);

#if 0
    Serial.print("G load: ");
    Serial.print(IMU_g);
    Serial.println();
#endif

#if defined(USE_OLED)
    IMU_g_x10 = (int32_t) (IMU_g * 10);
#endif /* USE_OLED */

    IMU_Time_Marker = millis();
  }
#endif /* EXCLUDE_IMU */

  if ((nRF52_board     == NRF52_SEEED_T1000E      ||
       nRF52_board     == NRF52_SEEED_X1          ||
       nRF52_board     == NRF52_ELECROW_TN_M1     ||
       nRF52_board     == NRF52_ELECROW_TN_M3     ||
       nRF52_board     == NRF52_ELECROW_TN_M8     ||
       nRF52_board     == NRF52_LILYGO_TECHO_PLUS ||
       nRF52_board     == NRF52_LILYGO_TECHO_CARD ||
       nRF52_board     == NRF52_SEEED_WIO_L1)     &&
      settings->volume != BUZZER_OFF              &&
      settings->mode   == SOFTRF_MODE_NORMAL      &&
      nRF52_has_vff    == false                   &&
      isValidFix()     == true) {
    uint8_t v = settings->volume;

    SoC->Sound_tone(1046, v); delay(200); SoC->Sound_tone(0, v);
    SoC->Sound_tone(1175, v); delay(200); SoC->Sound_tone(0, v);
    SoC->Sound_tone(1318, v); delay(200); SoC->Sound_tone(0, v);
    SoC->Sound_tone(1397, v); delay(400); SoC->Sound_tone(0, v);
                              delay(200);
    SoC->Sound_tone(1046, v); delay(200); SoC->Sound_tone(0, v);
    SoC->Sound_tone(1397, v); delay(400); SoC->Sound_tone(0, v);

    nRF52_has_vff = true;
  }
}

static void nRF52_fini(int reason)
{
#if !defined(ARDUINO_ARCH_MBED) && !defined(ARDUINO_ARCH_ZEPHYR)
  if (nRF52_has_spiflash) {
    usb_msc.setUnitReady(false);
//  usb_msc.end(); /* N/A */
  }

  if (SPIFlash != NULL) {
    FlashTrans->runCommand(0xB9); /* DP */
    SPIFlash->end();
  }
#endif /* ARDUINO_ARCH_MBED */

#if !defined(EXCLUDE_IMU)
  switch (hw_info.imu)
  {
    case IMU_MPU9250:
      imu_1.sleep(true);
      break;
    case IMU_ICM20948:
      imu_2.sleep(true);
      break;
    case ACC_QMA6100P:
      imu_3.enableAccel(false);
      break;
#if 0 /* TODO */ // !defined(EXCLUDE_BHI260)
    case IMU_BHI260AP:
      /* TBD */
      // imu_4.deinit();
      break;
#endif /* EXCLUDE_BHI260 */
    case ACC_SC7A20H:
      /* TBD */
      break;
    default:
      break;
  }
#endif /* EXCLUDE_IMU */

  switch (nRF52_board)
  {
    case NRF52_LILYGO_TECHO_REV_0:
#if 0
      /* Air530 GNSS ultra-low power tracking mode */
      digitalWrite(SOC_GPIO_PIN_GNSS_WKE, LOW);
      pinMode(SOC_GPIO_PIN_GNSS_WKE, OUTPUT);

