lyusupov/SoftRF/software/firmware/source/SoftRF/src/platform/nRF52.cpp
    // Serial_GNSS_Out.write("$PGKC105,4*33\r\n");
#else
      pinMode(SOC_GPIO_PIN_GNSS_WKE, INPUT);

      // Serial_GNSS_Out.write("$PGKC051,0*37\r\n");
      // Serial_GNSS_Out.write("$PGKC051,1*36\r\n");
#endif
      // Serial_GNSS_Out.flush(); delay(250);

      ledOff(SOC_GPIO_LED_TECHO_REV_0_GREEN);
      ledOff(SOC_GPIO_LED_TECHO_REV_0_RED);
      ledOff(SOC_GPIO_LED_TECHO_REV_0_BLUE);

      pinMode(SOC_GPIO_LED_TECHO_REV_0_GREEN, INPUT);
      pinMode(SOC_GPIO_LED_TECHO_REV_0_RED,   INPUT);
      pinMode(SOC_GPIO_LED_TECHO_REV_0_BLUE,  INPUT);

      pinMode(SOC_GPIO_PIN_IO_PWR, INPUT);
      pinMode(SOC_GPIO_PIN_SFL_SS, INPUT);
      break;

    case NRF52_LILYGO_TECHO_REV_1:
#if 0
      /* Air530 GNSS ultra-low power tracking mode */
      digitalWrite(SOC_GPIO_PIN_GNSS_WKE, LOW);
      pinMode(SOC_GPIO_PIN_GNSS_WKE, OUTPUT);

    // Serial_GNSS_Out.write("$PGKC105,4*33\r\n");
#else
      pinMode(SOC_GPIO_PIN_GNSS_WKE, INPUT);

      // Serial_GNSS_Out.write("$PGKC051,0*37\r\n");
      // Serial_GNSS_Out.write("$PGKC051,1*36\r\n");
#endif
      // Serial_GNSS_Out.flush(); delay(250);

      ledOff(SOC_GPIO_LED_TECHO_REV_1_GREEN);
      ledOff(SOC_GPIO_LED_TECHO_REV_1_RED);
      ledOff(SOC_GPIO_LED_TECHO_REV_1_BLUE);

      pinMode(SOC_GPIO_LED_TECHO_REV_1_GREEN, INPUT);
      pinMode(SOC_GPIO_LED_TECHO_REV_1_RED,   INPUT);
      pinMode(SOC_GPIO_LED_TECHO_REV_1_BLUE,  INPUT);

      pinMode(SOC_GPIO_PIN_SFL_WP,    INPUT);
      pinMode(SOC_GPIO_PIN_SFL_HOLD,  INPUT);
      pinMode(SOC_GPIO_PIN_SFL_SS,    INPUT);
      pinMode(SOC_GPIO_PIN_IO_PWR,    INPUT);
      /* Cut 3.3V power off on modded REV_1 board */
      pinMode(SOC_GPIO_PIN_TECHO_REV_1_3V3_PWR, INPUT_PULLDOWN);
      break;

    case NRF52_LILYGO_TECHO_REV_2:
    case NRF52_LILYGO_TECHO_PLUS:
      digitalWrite(SOC_GPIO_PIN_GNSS_WKE, LOW);

      ledOff(SOC_GPIO_LED_TECHO_REV_2_GREEN);
      ledOff(SOC_GPIO_LED_TECHO_REV_2_RED);
      ledOff(SOC_GPIO_LED_TECHO_REV_2_BLUE);

      pinMode(SOC_GPIO_LED_TECHO_REV_2_GREEN, INPUT_PULLUP);
      pinMode(SOC_GPIO_LED_TECHO_REV_2_RED,   INPUT_PULLUP);
      pinMode(SOC_GPIO_LED_TECHO_REV_2_BLUE,  INPUT_PULLUP);

      if ((nRF52_board == NRF52_LILYGO_TECHO_PLUS ||
           nRF52_board == NRF52_SEEED_X1)         &&
           nRF52_has_vibra == true) {
        vibra.stop();
#if SENSORLIB_VERSION == SENSORLIB_VERSION_VAL(0, 3, 1)
        vibra.setMode(1<<6); /* Standby */
#endif /* (0, 3, 1) */
#if SENSORLIB_VERSION >= SENSORLIB_VERSION_VAL(0, 4, 1)
        vibra.setMode(HapticMode::STANDBY);
#endif /* (0, 4, 1) */

        if (nRF52_board == NRF52_LILYGO_TECHO_PLUS) {
          pinMode(SOC_GPIO_PIN_MOTOR_EN, INPUT);
        }
      }

      pinMode(SOC_GPIO_PIN_SFL_HOLD,  INPUT);
      pinMode(SOC_GPIO_PIN_SFL_WP,    INPUT);
      pinMode(SOC_GPIO_PIN_SFL_SS,    INPUT);
      pinMode(SOC_GPIO_PIN_GNSS_RST,  INPUT);
      pinMode(SOC_GPIO_PIN_IO_PWR,    INPUT);
      /* Cut 3.3V power off on REV_2 board */
      // pinMode(SOC_GPIO_PIN_3V3_PWR,   INPUT_PULLDOWN);
      break;

    case NRF52_HELTEC_T114:
      pinMode(SOC_GPIO_PIN_GNSS_T114_RST, INPUT);
      digitalWrite(SOC_GPIO_PIN_GNSS_T114_WKE, LOW);

      ledOff(SOC_GPIO_LED_T114_GREEN);
      pinMode(SOC_GPIO_LED_T114_GREEN, INPUT);

      pinMode(SOC_GPIO_PIN_T114_ADC_EN,   INPUT);
      pinMode(SOC_GPIO_PIN_T114_TFT_BLGT, INPUT);
      pinMode(SOC_GPIO_PIN_T114_TFT_EN,   INPUT);
      pinMode(SOC_GPIO_PIN_T114_VEXT_EN,  INPUT);

      pinMode(SOC_GPIO_PIN_SFL_HOLD,  INPUT);
      pinMode(SOC_GPIO_PIN_SFL_WP,    INPUT);
      pinMode(SOC_GPIO_PIN_SFL_SS,    INPUT);
      break;

#if !defined(EXCLUDE_WIP)
    case NRF52_SEEED_WIO_L1:
      digitalWrite(SOC_GPIO_PIN_GNSS_L1_WKE, LOW);

      digitalWrite(SOC_GPIO_LED_L1_GREEN, 1-LED_STATE_ON);
      // digitalWrite(SOC_GPIO_LED_L1_BLUE,  1-LED_STATE_ON);

      pinMode(SOC_GPIO_LED_L1_GREEN,     INPUT);
      // pinMode(SOC_GPIO_LED_L1_BLUE,      INPUT);

      pinMode(SOC_GPIO_PIN_SFL_L1_HOLD,  INPUT);
      pinMode(SOC_GPIO_PIN_SFL_L1_WP,    INPUT);
      pinMode(SOC_GPIO_PIN_SFL_L1_SS,    INPUT);

      pinMode(SOC_GPIO_PIN_L1_VBAT_EN,   INPUT);
      break;

    case NRF52_SEEED_T2000:
      digitalWrite(SOC_GPIO_PIN_GNSS_T2000_WKE, LOW);

      digitalWrite(SOC_GPIO_LED_T2000_GREEN, 1-LED_STATE_ON);
      // digitalWrite(SOC_GPIO_LED_T2000_BLUE,  1-LED_STATE_ON);

      pinMode(SOC_GPIO_LED_T2000_GREEN,  INPUT);
      // pinMode(SOC_GPIO_LED_T2000_BLUE,   INPUT);

      pinMode(SOC_GPIO_PIN_SFL_T2000_HOLD,  INPUT);
      pinMode(SOC_GPIO_PIN_SFL_T2000_WP,    INPUT);
      pinMode(SOC_GPIO_PIN_SFL_T2000_SS,    INPUT);

      pinMode(SOC_GPIO_PIN_T2000_VBAT_EN,   INPUT);
      break;
#endif /* EXCLUDE_WIP */

    case NRF52_SEEED_T1000E:
      pinMode(SOC_GPIO_PIN_GNSS_T1000_RINT, INPUT_PULLDOWN);
      pinMode(SOC_GPIO_PIN_GNSS_T1000_SINT, INPUT_PULLDOWN);
      pinMode(SOC_GPIO_PIN_GNSS_T1000_RST,  INPUT_PULLDOWN);
      pinMode(SOC_GPIO_PIN_GNSS_T1000_VRTC, INPUT_PULLUP);
      pinMode(SOC_GPIO_PIN_GNSS_T1000_EN,   INPUT_PULLDOWN);

#if !defined(EXCLUDE_IMU)
      pinMode(SOC_GPIO_PIN_T1000_ACC_EN,    INPUT_PULLDOWN);
#endif /* EXCLUDE_IMU */
      pinMode(SOC_GPIO_PIN_T1000_BUZZER_EN, INPUT_PULLDOWN);
      pinMode(SOC_GPIO_PIN_T1000_3V3_EN,    INPUT_PULLDOWN);

      pinMode(SOC_GPIO_PIN_T1000_SS,        INPUT_PULLUP);

      digitalWrite(SOC_GPIO_LED_T1000_GREEN, 1-LED_STATE_ON);
      pinMode(SOC_GPIO_LED_T1000_GREEN,     INPUT);

      pinMode(SOC_GPIO_PIN_SFL_T1000_EN,    INPUT);
      break;

    case NRF52_ELECROW_TN_M1:
      digitalWrite(SOC_GPIO_PIN_GNSS_M1_WKE, LOW);

      digitalWrite(SOC_GPIO_LED_M1_RED,  1-LED_STATE_ON);
      digitalWrite(SOC_GPIO_LED_M1_BLUE, 1-LED_STATE_ON);

      pinMode(SOC_GPIO_LED_M1_RED,       INPUT);
      pinMode(SOC_GPIO_LED_M1_BLUE,      INPUT);
      pinMode(SOC_GPIO_LED_M1_RED_PWR,   INPUT);

      pinMode(SOC_GPIO_PIN_IO_M1_PWR,    INPUT);
      pinMode(SOC_GPIO_PIN_SFL_M1_HOLD,  INPUT);
      pinMode(SOC_GPIO_PIN_SFL_M1_WP,    INPUT);
      pinMode(SOC_GPIO_PIN_SFL_M1_SS,    INPUT);
      pinMode(SOC_GPIO_PIN_GNSS_M1_RST,  INPUT);
      break;

    case NRF52_ELECROW_TN_M3:
      digitalWrite(SOC_GPIO_PIN_GNSS_M3_WKE, LOW);
      digitalWrite(SOC_GPIO_LED_M3_RGB_PWR,  LOW);

      digitalWrite(SOC_GPIO_LED_M3_RED,  1-LED_STATE_ON);
      digitalWrite(SOC_GPIO_LED_M3_GREEN,1-LED_STATE_ON);
      digitalWrite(SOC_GPIO_LED_M3_BLUE, 1-LED_STATE_ON);

      pinMode(SOC_GPIO_LED_M3_RED,       INPUT);
      pinMode(SOC_GPIO_LED_M3_GREEN,     INPUT);
      pinMode(SOC_GPIO_LED_M3_BLUE,      INPUT);
      pinMode(SOC_GPIO_LED_M3_RGB_PWR,   INPUT);

//      pinMode(SOC_GPIO_PIN_GNSS_M3_WKE,  INPUT);
      pinMode(SOC_GPIO_PIN_GNSS_M3_RST,  INPUT);
      pinMode(SOC_GPIO_PIN_GNSS_M3_EN,   INPUT);
      pinMode(SOC_GPIO_PIN_M3_EEPROM_EN, INPUT);
      pinMode(SOC_GPIO_PIN_M3_EN1,       INPUT);
      pinMode(SOC_GPIO_PIN_M3_EN2,       INPUT);
      pinMode(SOC_GPIO_PIN_M3_ADC_EN,    INPUT);
      pinMode(SOC_GPIO_PIN_M3_ACC_EN,    INPUT);
      pinMode(SOC_GPIO_PIN_M3_TEMP_EN,   INPUT);
      break;

    case NRF52_ELECROW_TN_M6:
      digitalWrite(SOC_GPIO_PIN_GNSS_M6_WKE, LOW);

      digitalWrite(SOC_GPIO_LED_M6_RED,  1-LED_STATE_ON);
      digitalWrite(SOC_GPIO_LED_M6_BLUE, 1-LED_STATE_ON);

