lyusupov/SoftRF/software/firmware/source/SoftRF/src/platform/nRF52.cpp
      pinMode(SOC_GPIO_LED_M6_RED,       INPUT);
      pinMode(SOC_GPIO_LED_M6_BLUE,      INPUT);

//      pinMode(SOC_GPIO_PIN_GNSS_M6_WKE,  INPUT);
      pinMode(SOC_GPIO_PIN_GNSS_M6_RST,  INPUT);
      pinMode(SOC_GPIO_PIN_GNSS_M6_EN,   INPUT);
      pinMode(SOC_GPIO_PIN_M6_ADC_EN,    INPUT);
      pinMode(SOC_GPIO_PIN_SFL_M6_EN,    INPUT);
      pinMode(SOC_GPIO_PIN_IO_M6_PWR,    INPUT);
      break;

    case NRF52_LILYGO_TIMPULSE_PLUS:
      pinMode(SOC_GPIO_PIN_GNSS_TIP_PWR, INPUT);

      pinMode(SOC_GPIO_PIN_SFL_TIP_HOLD, INPUT);
      pinMode(SOC_GPIO_PIN_SFL_TIP_WP,   INPUT);
      pinMode(SOC_GPIO_PIN_SFL_TIP_SS,   INPUT);

      pinMode(SOC_GPIO_PIN_TIP_RX_EN,    INPUT);
      pinMode(SOC_GPIO_PIN_TIP_TX_EN,    INPUT);

      pinMode(SOC_GPIO_PIN_TIP_MOTOR,    INPUT);
      pinMode(SOC_GPIO_PIN_TIP_VBAT_EN,  INPUT);
      pinMode(SOC_GPIO_PIN_TIP_3V3_EN,   INPUT_PULLDOWN); /* LOW ? */

#if !defined(EXCLUDE_IMU)
      if (nRF52_has_imu || hw_info.pmu == BMU_SGM41562) {
#else
      if (hw_info.pmu == BMU_SGM41562) {
#endif
        Wire1.end();
      }
      break;

    case NRF52_LILYGO_TECHO_CARD:
//      pinMode(SOC_GPIO_PIN_GNSS_TEC_WKE,  INPUT);
      pinMode(SOC_GPIO_PIN_GNSS_TEC_PWR, INPUT);
      pinMode(SOC_GPIO_PIN_GNSS_TEC_SW,  INPUT);

#if !defined(EXCLUDE_LED_RING)
#if 0
      TEC_Pixel1.setPixelColor(0, LED_COLOR_BLACK);
      TEC_Pixel1.show();
#else
      T114_Pixels.setPixelColor(0, LED_COLOR_BLACK);
      T114_Pixels.show();
#endif
#endif /* EXCLUDE_LED_RING */

      pinMode(SOC_GPIO_PIN_SFL_TEC_HOLD, INPUT);
      pinMode(SOC_GPIO_PIN_SFL_TEC_WP,   INPUT);
      pinMode(SOC_GPIO_PIN_SFL_TEC_SS,   INPUT);

      pinMode(SOC_GPIO_PIN_TEC_RX_EN,    INPUT);
      pinMode(SOC_GPIO_PIN_TEC_TX_EN,    INPUT);

      pinMode(SOC_GPIO_PIN_I2S_TEC_EN,   INPUT);
      pinMode(SOC_GPIO_PIN_I2S_TEC_PWR,  INPUT);

      pinMode(SOC_GPIO_PIN_TEC_VBAT_EN,  INPUT);
      pinMode(SOC_GPIO_PIN_TEC_3V3_EN,   INPUT_PULLDOWN); /* LOW ? */
      break;

    case NRF52_SEEED_X1:
      pinMode(SOC_GPIO_PIN_GNSS_X1_RINT,    INPUT_PULLDOWN);
      pinMode(SOC_GPIO_PIN_GNSS_X1_SINT,    INPUT_PULLDOWN);
      pinMode(SOC_GPIO_PIN_GNSS_X1_RST,     INPUT_PULLDOWN);
      pinMode(SOC_GPIO_PIN_GNSS_X1_VRTC,    INPUT_PULLUP);
      pinMode(SOC_GPIO_PIN_GNSS_X1_EN,      INPUT_PULLDOWN);

      pinMode(SOC_GPIO_PIN_X1_3V3_EN,       INPUT_PULLDOWN);

      pinMode(SOC_GPIO_PIN_X1_SS,           INPUT_PULLUP);

      pinMode(SOC_GPIO_PIN_X1_BUZZER,       INPUT_PULLDOWN);

      digitalWrite(SOC_GPIO_LED_X1_RED,     1-LED_STATE_ON);
      pinMode(SOC_GPIO_LED_X1_RED,          INPUT);
      digitalWrite(SOC_GPIO_LED_X1_GREEN,   1-LED_STATE_ON);
      pinMode(SOC_GPIO_LED_X1_GREEN,        INPUT);
      digitalWrite(SOC_GPIO_LED_X1_BLUE,    1-LED_STATE_ON);
      pinMode(SOC_GPIO_LED_X1_BLUE,         INPUT);

      pinMode(SOC_GPIO_PIN_X1_VBAT_EN,      INPUT);
      pinMode(SOC_GPIO_PIN_SFL_X1_EN,       INPUT);
      pinMode(SOC_GPIO_PIN_X1_HAPTIC_EN,    INPUT);
      pinMode(SOC_GPIO_PIN_X1_RTC_EN,       INPUT);
      break;

    case NRF52_NORDIC_PCA10059:
    default:
//      ledOff(SOC_GPIO_LED_PCA10059_GREEN);
      ledOff(SOC_GPIO_LED_PCA10059_RED);
      ledOff(SOC_GPIO_LED_PCA10059_BLUE);
      ledOff(SOC_GPIO_LED_PCA10059_STATUS);

//      pinMode(SOC_GPIO_LED_PCA10059_GREEN,  INPUT);
      pinMode(SOC_GPIO_LED_PCA10059_RED,    INPUT);
      pinMode(SOC_GPIO_LED_PCA10059_BLUE,   INPUT);
      pinMode(SOC_GPIO_LED_PCA10059_STATUS, INPUT);
      break;
  }

  Serial_GNSS_In.end();

  // pinMode(SOC_GPIO_PIN_GNSS_RX, INPUT);
  // pinMode(SOC_GPIO_PIN_GNSS_TX, INPUT);

  // pinMode(SOC_GPIO_PIN_BATTERY, INPUT);

#if !defined(ARDUINO_ARCH_MBED) && !defined(ARDUINO_ARCH_ZEPHYR)
  if (i2c != nullptr) Wire.end();
#endif /* ARDUINO_ARCH_MBED */

  if (nRF52_board == NRF52_HELTEC_T114) {
    pinMode(SOC_GPIO_PIN_T114_SDA_EXT,  INPUT);
    pinMode(SOC_GPIO_PIN_T114_SCL_EXT,  INPUT);
  } else {
    pinMode(SOC_GPIO_PIN_SDA,           INPUT);
    pinMode(SOC_GPIO_PIN_SCL,           INPUT);
  }

  // pinMode(SOC_GPIO_PIN_MOSI, INPUT);
  // pinMode(SOC_GPIO_PIN_MISO, INPUT);
  // pinMode(SOC_GPIO_PIN_SCK,  INPUT);

  /* TBD */
  if (nRF52_board != NRF52_SEEED_T1000E         &&
      nRF52_board != NRF52_SEEED_X1             &&
      nRF52_board != NRF52_LILYGO_TECHO_CARD    &&
      nRF52_board != NRF52_LILYGO_TIMPULSE_PLUS &&
      nRF52_board != NRF52_ELECROW_TN_M3        &&
      nRF52_board != NRF52_ELECROW_TN_M6        &&
      nRF52_board != NRF52_ELECROW_TN_M8) {
    pinMode(SOC_GPIO_PIN_SS, INPUT_PULLUP);
  }

  // pinMode(SOC_GPIO_PIN_BUSY, INPUT);
  pinMode(lmic_pins.rst,  INPUT);

  int mode_button_pin;

  switch (nRF52_board)
  {
#if !defined(EXCLUDE_WIP)
    case NRF52_SEEED_WIO_L1:
      mode_button_pin = SOC_GPIO_PIN_L1_BUTTON;
      break;

    case NRF52_SEEED_T2000:
      mode_button_pin = SOC_GPIO_PIN_T2000_BUTTON;
      break;

    case NRF52_HELTEC_T1:
      mode_button_pin = SOC_GPIO_PIN_T1_BUTTON1;
      break;
#endif /* EXCLUDE_WIP */

    case NRF52_SEEED_T1000E:
    case NRF52_SEEED_X1:
      mode_button_pin = SOC_GPIO_PIN_T1000_BUTTON;
      break;

    case NRF52_HELTEC_T114:
      mode_button_pin = SOC_GPIO_PIN_T114_BUTTON;
      break;

    case NRF52_ELECROW_TN_M1:
      mode_button_pin = SOC_GPIO_PIN_M1_BUTTON1;
      break;

    case NRF52_ELECROW_TN_M3:
      mode_button_pin = SOC_GPIO_PIN_M3_BUTTON;
      break;

    case NRF52_ELECROW_TN_M6:
      mode_button_pin = SOC_GPIO_PIN_M6_BUTTON;
      break;

    case NRF52_ELECROW_TN_M8:
      mode_button_pin = SOC_GPIO_PIN_M8_ENC_BTN;
      break;

    case NRF52_LILYGO_TIMPULSE_PLUS:
      mode_button_pin = SOC_GPIO_PIN_TIP_PAD;
      break;

    case NRF52_LILYGO_TECHO_CARD:
      mode_button_pin = SOC_GPIO_PIN_TEC_BUTTON;
      break;

    case NRF52_LILYGO_TECHO_REV_0:
    case NRF52_LILYGO_TECHO_REV_1:
    case NRF52_LILYGO_TECHO_REV_2:
    case NRF52_LILYGO_TECHO_PLUS:
    case NRF52_NORDIC_PCA10059:
    default:
      mode_button_pin = SOC_GPIO_PIN_BUTTON;
      break;
  }

  // pinMode(SOC_GPIO_PIN_PAD,    INPUT);
  pinMode(mode_button_pin, nRF52_board == NRF52_LILYGO_TECHO_REV_1 ? INPUT_PULLUP   :
                           nRF52_board == NRF52_SEEED_T1000E       ? INPUT_PULLDOWN :
                           nRF52_board == NRF52_SEEED_X1           ? INPUT_PULLDOWN :
                           nRF52_board == NRF52_ELECROW_TN_M6      ? INPUT_PULLUP   :
                           INPUT);
  while (digitalRead(mode_button_pin) == (nRF52_board == NRF52_SEEED_T1000E ||
                                          nRF52_board == NRF52_SEEED_X1     ?
                                          HIGH : LOW));
  delay(100);

#if defined(USE_TINYUSB)
  Serial1.end();

  // pinMode(SOC_GPIO_PIN_CONS_RX, INPUT);
  // pinMode(SOC_GPIO_PIN_CONS_TX, INPUT);
#endif

  // setup wake-up pins
  switch (reason)
  {
  case SOFTRF_SHUTDOWN_BUTTON:
  case SOFTRF_SHUTDOWN_LOWBAT:
    NRF_POWER->GPREGRET = DFU_MAGIC_SKIP;
#if !defined(ARDUINO_ARCH_MBED) && !defined(ARDUINO_ARCH_ZEPHYR)
    pinMode(mode_button_pin, nRF52_board == NRF52_SEEED_T1000E ||
                             nRF52_board == NRF52_SEEED_X1     ?
                             INPUT_PULLDOWN_SENSE /* INPUT_SENSE_HIGH */ :
                             INPUT_PULLUP_SENSE   /* INPUT_SENSE_LOW  */);
#endif /* ARDUINO_ARCH_MBED */
    break;
#if defined(USE_SERIAL_DEEP_SLEEP)
  case SOFTRF_SHUTDOWN_NMEA:
#if !defined(ARDUINO_ARCH_MBED) && !defined(ARDUINO_ARCH_ZEPHYR)
    pinMode(SOC_GPIO_PIN_CONS_RX, INPUT_PULLUP_SENSE /* INPUT_SENSE_LOW */);
#endif /* ARDUINO_ARCH_MBED */
    break;
#endif
  default:
    break;
  }

  Serial.end();

  nRF52_system_off();
}

static void nRF52_reset()
{
#if !defined(ARDUINO_ARCH_MBED) && !defined(ARDUINO_ARCH_ZEPHYR)
  if (nrf_wdt_started(NRF_WDT)) {
    // When WDT is active - CRV, RREN and CONFIG are blocked
    // There is no way to stop/disable watchdog using source code
    // It can only be reset by WDT timeout, Pin reset, Power reset

    switch (hw_info.display)
    {
#if defined(USE_EPAPER)
    case DISPLAY_EPD_1_54:
#if defined(USE_EPD_TASK)
      while (EPD_update_in_progress != EPD_UPDATE_NONE) { delay(100); }
//    while (!SoC->Display_lock()) { delay(10); }
#endif

      EPD_Message("PLEASE,", "WAIT..");
      break;
#endif /* USE_EPAPER */

