lyusupov/SoftRF/software/firmware/source/SoftRF/src/platform/nRF52.cpp
#if defined(USE_TFT)
    case DISPLAY_TFT_TTGO_135:
      if (tft) {
        const char *msg = "WAIT";

        tft->fillScreen(TFT_NAVY);
        tft->setTextFont(4);
        tft->setTextSize(2);

        tft->setTextColor(TFT_WHITE, TFT_NAVY);

        uint16_t tbw = tft->textWidth(msg);
        uint16_t tbh = tft->fontHeight();

        tft->setCursor((tft->width() - tbw)/2, (tft->height() - tbh)/2);
        tft->print(msg);
      }
      break;
#endif /* USE_TFT */

    case DISPLAY_NONE:
    default:
      break;
    }

    while (true) { delay(100); }
  } else {
    NVIC_SystemReset();
  }
#else
  /* TBD */
#endif /* ARDUINO_ARCH_MBED */
}

static uint32_t nRF52_getChipId()
{
#if !defined(SOFTRF_ADDRESS)
  uint32_t id = DEVICE_ID_LOW;

  return DevID_Mapper(id);
#else
  return (SOFTRF_ADDRESS & 0xFFFFFFFFU );
#endif
}

static void* nRF52_getResetInfoPtr()
{
  return (void *) &reset_info;
}

static String nRF52_getResetInfo()
{
  switch (reset_info.reason)
  {
    default                     : return F("No reset information available");
  }
}

static String nRF52_getResetReason()
{
  switch (reset_info.reason)
  {
    case REASON_DEFAULT_RST       : return F("DEFAULT");
    case REASON_WDT_RST           : return F("WDT");
    case REASON_EXCEPTION_RST     : return F("EXCEPTION");
    case REASON_SOFT_WDT_RST      : return F("SOFT_WDT");
    case REASON_SOFT_RESTART      : return F("SOFT_RESTART");
    case REASON_DEEP_SLEEP_AWAKE  : return F("DEEP_SLEEP_AWAKE");
    case REASON_EXT_SYS_RST       : return F("EXT_SYS");
    default                       : return F("NO_MEAN");
  }
}

static uint32_t nRF52_getFreeHeap()
{
#if !defined(ARDUINO_ARCH_MBED) && !defined(ARDUINO_ARCH_ZEPHYR)
  return dbgHeapTotal() - dbgHeapUsed();
#else
  return 0; /* TBD */
#endif /* ARDUINO_ARCH_MBED */
}

static long nRF52_random(long howsmall, long howBig)
{
  return random(howsmall, howBig);
}

#if defined(USE_USB_MIDI)
byte note_sequence[] = {62,65,69,65,67,67,65,64,69,69,67,67,62,62};
#endif /* USE_USB_MIDI */

static void nRF52_Sound_test(int var)
{
#if defined(USE_USB_MIDI)
  if (USBDevice.mounted() && settings->volume != BUZZER_OFF) {
    unsigned int position = 0;
    unsigned int current  = 0;

    for (; position <= sizeof(note_sequence); position++) {
      // Setup variables for the current and previous
      // positions in the note sequence.
      current = position;
      // If we currently are at position 0, set the
      // previous position to the last note in the sequence.
      unsigned int previous = (current == 0) ? (sizeof(note_sequence)-1) : current - 1;

      // Send Note On for current position at full velocity (127) on channel 1.
      MIDI_USB.sendNoteOn(note_sequence[current], 127, MIDI_CHANNEL_TRAFFIC);

      // Send Note Off for previous note.
      MIDI_USB.sendNoteOff(note_sequence[previous], 0, MIDI_CHANNEL_TRAFFIC);

      delay(286);
    }

    MIDI_USB.sendNoteOff(note_sequence[current], 0, MIDI_CHANNEL_TRAFFIC);
  }
#endif /* USE_USB_MIDI */

  if ((nRF52_board == NRF52_LILYGO_TECHO_PLUS ||
       nRF52_board == NRF52_SEEED_X1)         &&
       nRF52_has_vibra == true) {
    vibra.setWaveform(0, 75); /* Transition Ramp Down Short Smooth 2 - 100 to 0% */
    vibra.setWaveform(1, 0);
    vibra.run();
  }

#if defined(USE_PWM_SOUND)
  if (SOC_GPIO_PIN_BUZZER != SOC_UNUSED_PIN && settings->volume != BUZZER_OFF) {
    tone(SOC_GPIO_PIN_BUZZER, 440,  500); delay(500);
    tone(SOC_GPIO_PIN_BUZZER, 640,  500); delay(500);
    tone(SOC_GPIO_PIN_BUZZER, 840,  500); delay(500);
    tone(SOC_GPIO_PIN_BUZZER, 1040, 500); delay(600);

    noTone(SOC_GPIO_PIN_BUZZER);
    pinMode(SOC_GPIO_PIN_BUZZER, INPUT);
  }
#endif /* USE_PWM_SOUND */
}

#if defined(USE_BLE_MIDI)
extern BLEMidi blemidi;
extern midi::MidiInterface<BLEMidi> MIDI_BLE;
#endif /* USE_BLE_MIDI */

static void nRF52_Sound_tone(int hz, uint8_t volume)
{
#if defined(USE_PWM_SOUND)
  if (SOC_GPIO_PIN_BUZZER != SOC_UNUSED_PIN && volume != BUZZER_OFF) {
    if (hz > 0) {
      tone(SOC_GPIO_PIN_BUZZER, hz, ALARM_TONE_MS);
    } else {
      noTone(SOC_GPIO_PIN_BUZZER);
      pinMode(SOC_GPIO_PIN_BUZZER, INPUT);
    }
  }
#endif /* USE_PWM_SOUND */

#if defined(USE_USB_MIDI)
  if (USBDevice.mounted() && volume != BUZZER_OFF) {
    if (hz > 0) {
      MIDI_USB.sendNoteOn (60, 127, MIDI_CHANNEL_TRAFFIC); // 60 == middle C
    } else {
      MIDI_USB.sendNoteOff(60,   0, MIDI_CHANNEL_TRAFFIC);
    }
  }
#endif /* USE_USB_MIDI */

#if defined(USE_BLE_MIDI)
  if (volume != BUZZER_OFF  &&
      Bluefruit.connected() &&
      blemidi.notifyEnabled()) {
    if (hz > 0) {
      MIDI_BLE.sendNoteOn (60, 127, MIDI_CHANNEL_TRAFFIC); // 60 == middle C
    } else {
      MIDI_BLE.sendNoteOff(60,   0, MIDI_CHANNEL_TRAFFIC);
    }
  }
#endif /* USE_BLE_MIDI */
}

static void nRF52_WiFi_set_param(int ndx, int value)
{
  /* NONE */
}

static void nRF52_WiFi_transmit_UDP(int port, byte *buf, size_t size)
{
  /* NONE */
}

static bool nRF52_EEPROM_begin(size_t size)
{
#if !defined(EXCLUDE_EEPROM)
  if (size > EEPROM.length()) {
    return false;
  }

  EEPROM.begin();
#endif /* EXCLUDE_EEPROM */

  return true;
}

static void nRF52_EEPROM_extension(int cmd)
{
  uint8_t *raw = (uint8_t *) ui;

  switch (cmd)
  {
    case EEPROM_EXT_STORE:
#if !defined(EXCLUDE_EEPROM)
      for (int i=0; i<sizeof(ui_settings_t); i++) {
        EEPROM.write(sizeof(eeprom_t) + i, raw[i]);
      }
#endif /* EXCLUDE_EEPROM */
      return;
    case EEPROM_EXT_DEFAULTS:
      ui->adapter      = 0;
      ui->connection   = 0;
      ui->units        = UNITS_METRIC;
      ui->zoom         = ZOOM_MEDIUM;
      ui->protocol     = PROTOCOL_NMEA;
      ui->baudrate     = 0;
      strcpy(ui->server, "");
      strcpy(ui->key,    "");
      ui->rotate       = ROTATE_0;
      ui->orientation  = DIRECTION_TRACK_UP;
      ui->adb          = DB_OGN;
      ui->idpref       = ID_TYPE;
      ui->vmode        = VIEW_MODE_STATUS;
      ui->voice        = VOICE_OFF;
      ui->aghost       = ANTI_GHOSTING_OFF;
      ui->filter       = TRAFFIC_FILTER_OFF;
      ui->power_save   = 0;
      ui->team         = 0;

#if defined(USE_PWM_SOUND)
      if (nRF52_board == NRF52_LILYGO_TECHO_PLUS) {
        settings->volume = BUZZER_VOLUME_FULL;
      }
#endif /* USE_PWM_SOUND */
      break;
    case EEPROM_EXT_LOAD:
    default:
#if !defined(EXCLUDE_EEPROM)
      for (int i=0; i<sizeof(ui_settings_t); i++) {
        raw[i] = EEPROM.read(sizeof(eeprom_t) + i);
      }
#endif /* EXCLUDE_EEPROM */
#if !defined(ARDUINO_ARCH_MBED) && !defined(ARDUINO_ARCH_ZEPHYR)
      if ( nRF52_has_spiflash && FATFS_is_mounted ) {
        File32 file = fatfs.open(SETTINGS_JSON_PATH, FILE_READ);

        if (file) {
          // StaticJsonBuffer<NRF52_JSON_BUFFER_SIZE> nRF52_jsonBuffer;

