lyusupov/SoftRF/software/firmware/source/SoftRF/src/platform/nRF52.cpp
          JsonObject &root = nRF52_jsonBuffer.parseObject(file);

          if (root.success()) {
            JsonVariant msg_class = root["class"];

            if (msg_class.success()) {
              const char *msg_class_s = msg_class.as<char*>();

              if (!strcmp(msg_class_s,"SOFTRF")) {
                parseSettings  (root);
                parseUISettings(root);

                JsonVariant adb = root["adb"];
                if (adb.success()) {
                  const char * adb_s = adb.as<char*>();
                  if (!strcmp(adb_s,"NONE")) {
                    ui_settings.adb = DB_NONE;
                  } else if (!strcmp(adb_s,"FLN")) {
                    ui_settings.adb = DB_FLN;
                  } else if (!strcmp(adb_s,"OGN")) {
                    ui_settings.adb = DB_OGN;
                  }
                }

#if defined(ENABLE_PROL)
                JsonVariant fromcall = root["fromcall"];
                if (fromcall.success()) {
                  const char * fromcall_s = fromcall.as<char*>();
                  if (strlen(fromcall_s) < sizeof(APRS_FromCall)) {
                    strncpy(APRS_FromCall, fromcall_s, sizeof(APRS_FromCall));
                  }
                }
                JsonVariant tocall = root["tocall"];
                if (tocall.success()) {
                  const char * tocall_s = tocall.as<char*>();
                  if (strlen(tocall_s) < sizeof(APRS_ToCall)) {
                    strncpy(APRS_ToCall, tocall_s, sizeof(APRS_ToCall));
                  }
                }
                JsonVariant path = root["path"];
                if (path.success()) {
                  const char * path_s = path.as<char*>();
                  if (strlen(path_s) < sizeof(APRS_Path)) {
                    strncpy(APRS_Path, path_s, sizeof(APRS_Path));
                  }
                }
#endif /* ENABLE_PROL */
#if defined(ENABLE_REMOTE_ID)
                JsonVariant opid = root["uas_opid"];
                if (opid.success()) {
                  const char * opid_s = opid.as<char*>();
                  if (strlen(opid_s) < sizeof(RID_Operator_ID)) {
                    strncpy(RID_Operator_ID, opid_s, sizeof(RID_Operator_ID));
                  }
                }
                JsonVariant drid = root["uas_drid"];
                if (drid.success()) {
                  const char * drid_s = drid.as<char*>();
                  if (strlen(drid_s) < sizeof(RID_Drone_ID)) {
                    strncpy(RID_Drone_ID, drid_s, sizeof(RID_Drone_ID));
                  }
                }
#endif /* ENABLE_REMOTE_ID */
              }
            }
          }
          file.close();
        }
      }
#endif /* ARDUINO_ARCH_MBED */

#if defined(USE_WEBUSB_SETTINGS) && !defined(USE_WEBUSB_SERIAL)

      usb_web.setLandingPage(&landingPage);
      usb_web.begin();

#endif /* USE_WEBUSB_SETTINGS */

      if (settings->mode != SOFTRF_MODE_NORMAL
#if !defined(EXCLUDE_TEST_MODE)
          &&
          settings->mode != SOFTRF_MODE_TXRX_TEST
#endif /* EXCLUDE_TEST_MODE */
          ) {
        settings->mode = SOFTRF_MODE_NORMAL;
      }

      if (settings->nmea_out == NMEA_UDP  ||
          settings->nmea_out == NMEA_TCP ) {
        settings->nmea_out = NMEA_BLUETOOTH;
      }
      if (settings->gdl90 == GDL90_UDP) {
        settings->gdl90 = GDL90_BLUETOOTH;
      }
      if (settings->d1090 == D1090_UDP) {
        settings->d1090 = D1090_BLUETOOTH;
      }

      /* AUTO and UK RF bands are deprecated since Release v1.3 */
      if (settings->band == RF_BAND_AUTO || settings->band == RF_BAND_UK) {
        settings->band = RF_BAND_EU;
      }

      break;
  }
}

static void nRF52_SPI_begin()
{
#if !defined(ARDUINO_ARCH_MBED) && !defined(ARDUINO_ARCH_ZEPHYR)
  switch (nRF52_board)
  {
#if !defined(EXCLUDE_WIP)
    case NRF52_SEEED_WIO_L1:
      SPI.setPins(SOC_GPIO_PIN_L1_MISO,
                  SOC_GPIO_PIN_L1_SCK,
                  SOC_GPIO_PIN_L1_MOSI);
      break;
    case NRF52_SEEED_T2000:
      SPI.setPins(SOC_GPIO_PIN_T2000_MISO,
                  SOC_GPIO_PIN_T2000_SCK,
                  SOC_GPIO_PIN_T2000_MOSI);
      break;
    case NRF52_HELTEC_T1:
      SPI.setPins(SOC_GPIO_PIN_T1_MISO,
                  SOC_GPIO_PIN_T1_SCK,
                  SOC_GPIO_PIN_T1_MOSI);
      break;
    case NRF52_ELECROW_TN_M8:
      SPI.setPins(SOC_GPIO_PIN_M8_MISO,
                  SOC_GPIO_PIN_M8_SCK,
                  SOC_GPIO_PIN_M8_MOSI);
      break;
#endif /* EXCLUDE_WIP */
    case NRF52_SEEED_T1000E:
    case NRF52_SEEED_X1:
      SPI.setPins(SOC_GPIO_PIN_T1000_MISO,
                  SOC_GPIO_PIN_T1000_SCK,
                  SOC_GPIO_PIN_T1000_MOSI);
      break;
    case NRF52_ELECROW_TN_M3:
      SPI.setPins(SOC_GPIO_PIN_M3_MISO,
                  SOC_GPIO_PIN_M3_SCK,
                  SOC_GPIO_PIN_M3_MOSI);
      break;
    case NRF52_ELECROW_TN_M6:
      SPI.setPins(SOC_GPIO_PIN_M6_MISO,
                  SOC_GPIO_PIN_M6_SCK,
                  SOC_GPIO_PIN_M6_MOSI);
      break;
    case NRF52_LILYGO_TIMPULSE_PLUS:
      SPI.setPins(SOC_GPIO_PIN_TIP_MISO,
                  SOC_GPIO_PIN_TIP_SCK,
                  SOC_GPIO_PIN_TIP_MOSI);
      break;
    case NRF52_LILYGO_TECHO_CARD:
      SPI.setPins(SOC_GPIO_PIN_TEC_MISO,
                  SOC_GPIO_PIN_TEC_SCK,
                  SOC_GPIO_PIN_TEC_MOSI);
      break;
    case NRF52_NORDIC_PCA10059:
      SPI.setPins(SOC_GPIO_PIN_PCA10059_MISO,
                  SOC_GPIO_PIN_PCA10059_SCK,
                  SOC_GPIO_PIN_PCA10059_MOSI);
      break;
    case NRF52_LILYGO_TECHO_REV_0:
    case NRF52_LILYGO_TECHO_REV_1:
    case NRF52_LILYGO_TECHO_REV_2:
    case NRF52_LILYGO_TECHO_PLUS:
    case NRF52_HELTEC_T114:
    case NRF52_ELECROW_TN_M1:
    default:
      SPI.setPins(SOC_GPIO_PIN_TECHO_REV_0_MISO,
                  SOC_GPIO_PIN_TECHO_REV_0_SCK,
                  SOC_GPIO_PIN_TECHO_REV_0_MOSI);
      break;
  }
#endif /* ARDUINO_ARCH_MBED */

  SPI.begin();
}

