lyusupov/SoftRF/software/firmware/source/SoftRF/src/platform/nRF52.cpp
static void nRF52_swSer_begin(unsigned long baud)
{
#if !defined(ARDUINO_ARCH_MBED) && !defined(ARDUINO_ARCH_ZEPHYR)
  switch (nRF52_board)
  {
#if !defined(EXCLUDE_WIP)
    case NRF52_SEEED_WIO_L1:
      Serial_GNSS_In.setPins(SOC_GPIO_PIN_GNSS_L1_RX,
                             SOC_GPIO_PIN_GNSS_L1_TX);
      break;
    case NRF52_SEEED_T2000:
      Serial_GNSS_In.setPins(SOC_GPIO_PIN_GNSS_T2000_RX,
                             SOC_GPIO_PIN_GNSS_T2000_TX);
      break;
    case NRF52_HELTEC_T1:
      /* TBD */
      break;
    case NRF52_ELECROW_TN_M8:
      Serial_GNSS_In.setPins(SOC_GPIO_PIN_GNSS_M8_RX,
                             SOC_GPIO_PIN_GNSS_M8_TX);
      break;
#endif /* EXCLUDE_WIP */
    case NRF52_SEEED_T1000E:
    case NRF52_SEEED_X1:
      Serial_GNSS_In.setPins(SOC_GPIO_PIN_GNSS_T1000_RX,
                             SOC_GPIO_PIN_GNSS_T1000_TX);
      baud = 115200; /* Airoha AG3335 default value */
      break;
    case NRF52_HELTEC_T114:
      Serial_GNSS_In.setPins(SOC_GPIO_PIN_GNSS_T114_RX,
                             SOC_GPIO_PIN_GNSS_T114_TX);
      break;
    case NRF52_ELECROW_TN_M3:
      Serial_GNSS_In.setPins(SOC_GPIO_PIN_GNSS_M3_RX,
                             SOC_GPIO_PIN_GNSS_M3_TX);
      break;
    case NRF52_ELECROW_TN_M6:
      Serial_GNSS_In.setPins(SOC_GPIO_PIN_GNSS_M6_RX,
                             SOC_GPIO_PIN_GNSS_M6_TX);
      break;
    case NRF52_LILYGO_TIMPULSE_PLUS:
      Serial_GNSS_In.setPins(SOC_GPIO_PIN_GNSS_TIP_RX,
                             SOC_GPIO_PIN_GNSS_TIP_TX);
      baud = 38400; /* u-blox MIA-M10Q default value (9600 in the safe boot) */
      break;
    case NRF52_LILYGO_TECHO_CARD:
      Serial_GNSS_In.setPins(SOC_GPIO_PIN_GNSS_TEC_RX,
                             SOC_GPIO_PIN_GNSS_TEC_TX);
      break;
    case NRF52_LILYGO_TECHO_REV_0:
    case NRF52_LILYGO_TECHO_REV_1:
    case NRF52_LILYGO_TECHO_REV_2:
    case NRF52_LILYGO_TECHO_PLUS:
    case NRF52_NORDIC_PCA10059:
    case NRF52_ELECROW_TN_M1:
    default:
      Serial_GNSS_In.setPins(SOC_GPIO_PIN_GNSS_RX, SOC_GPIO_PIN_GNSS_TX);
      break;
  }
#endif /* ARDUINO_ARCH_MBED */

  Serial_GNSS_In.begin(baud);

  if (nRF52_board == NRF52_SEEED_T1000E ||
      nRF52_board == NRF52_SEEED_X1)
  {
    for (int i=0; i<25; i++) {
      /* Enable Sleep mode locking */
      Serial_GNSS_Out.write("$PAIR382,1*2E\r\n"); delay(40);
    }
  }
}

static void nRF52_swSer_enableRx(boolean arg)
{
  /* NONE */
}

#if !defined(ARDUINO_ARCH_MBED) && !defined(ARDUINO_ARCH_ZEPHYR)
SemaphoreHandle_t Display_Semaphore;
#endif /* ARDUINO_ARCH_MBED */
unsigned long TaskInfoTime;

#if defined(USE_EPAPER)

#include <SoftSPI.h>
SoftSPI swSPI(SOC_GPIO_PIN_EPD_MOSI,
              SOC_GPIO_PIN_EPD_MOSI, /* half duplex */
              SOC_GPIO_PIN_EPD_SCK);

static nRF52_display_id nRF52_EPD_ident()
{
  nRF52_display_id rval = EP_GDEH0154D67; /* default */

  digitalWrite(SOC_GPIO_PIN_EPD_SS, HIGH);
  pinMode(SOC_GPIO_PIN_EPD_SS, OUTPUT);
  digitalWrite(SOC_GPIO_PIN_EPD_DC, HIGH);
  pinMode(SOC_GPIO_PIN_EPD_DC, OUTPUT);

  digitalWrite(SOC_GPIO_PIN_EPD_RST, LOW);
  pinMode(SOC_GPIO_PIN_EPD_RST, OUTPUT);
  delay(20);
  pinMode(SOC_GPIO_PIN_EPD_RST, INPUT_PULLUP);
  delay(200);
  pinMode(SOC_GPIO_PIN_EPD_BUSY, INPUT);

  swSPI.begin();

  uint8_t buf_2D[11];
  uint8_t buf_2E[10];

  taskENTER_CRITICAL();

  digitalWrite(SOC_GPIO_PIN_EPD_DC, LOW);
  digitalWrite(SOC_GPIO_PIN_EPD_SS, LOW);

  swSPI.transfer_out(0x2D);

  pinMode(SOC_GPIO_PIN_EPD_MOSI, INPUT);
  digitalWrite(SOC_GPIO_PIN_EPD_DC, HIGH);

  for (int i=0; i<sizeof(buf_2D); i++) {
    buf_2D[i] = swSPI.transfer_in();
  }

  digitalWrite(SOC_GPIO_PIN_EPD_SCK, LOW);
  digitalWrite(SOC_GPIO_PIN_EPD_DC,  LOW);
  digitalWrite(SOC_GPIO_PIN_EPD_SS,  HIGH);

  taskEXIT_CRITICAL();

  delay(1);

  taskENTER_CRITICAL();

  digitalWrite(SOC_GPIO_PIN_EPD_DC, LOW);
  digitalWrite(SOC_GPIO_PIN_EPD_SS, LOW);

  swSPI.transfer_out(0x2E);

  pinMode(SOC_GPIO_PIN_EPD_MOSI, INPUT);
  digitalWrite(SOC_GPIO_PIN_EPD_DC, HIGH);

  for (int i=0; i<sizeof(buf_2E); i++) {
    buf_2E[i] = swSPI.transfer_in();
  }

  digitalWrite(SOC_GPIO_PIN_EPD_SCK, LOW);
  digitalWrite(SOC_GPIO_PIN_EPD_DC,  LOW);
  digitalWrite(SOC_GPIO_PIN_EPD_SS,  HIGH);

  taskEXIT_CRITICAL();

  swSPI.end();

#if 0
  Serial.print("2D: ");
  for (int i=0; i<sizeof(buf_2D); i++) {
    Serial.print(buf_2D[i], HEX);
    Serial.print(' ');
  }
  Serial.println();

  Serial.print("2E: ");
  for (int i=0; i<sizeof(buf_2E); i++) {
    Serial.print(buf_2E[i], HEX);
    Serial.print(' ');
  }
  Serial.println();

/*
 *  0x2D:
 *  FF FF FF FF FF FF FF FF FF FF FF - C1
 *  00 00 00 00 00 FF 40 00 00 00 01 - D67 SYX 1942
 *  00 00 00 FF 00 00 40 01 00 00 00 - D67 SYX 2118
 *  00 00 00 FF 00 00 40 01 00 00 00 - D67 SYX 2129
 *  00 00 00 00 00 00 00 00 00 00 00 - DEPG0150BN
 *  00 00 40 20 10 00 40 03 00 00 00 - TBD (M1)
 *                                   - "20.05.21" (Plus)
 *
 *  0x2E:
 *  00 00 00 00 00 00 00 00 00 00    - C1
 *  00 00 00 00 00 00 00 00 00 00    - D67 SYX 1942
 *  00 05 00 9A 00 55 35 37 14 0C    - D67 SYX 2118
 *  00 00 00 00 00 00 00 00 00 00    - D67 SYX 2129
 *  00 00 00 00 00 00 00 00 00 00    - DEPG0150BN
 *  00 00 00 00 00 00 00 00 00 00    - TBD (M1)
 *                                   - "20.05.21" (Plus)
 */
#endif

  bool is_ff = true;
  for (int i=0; i<sizeof(buf_2D); i++) {
    if (buf_2D[i] != 0xFF) {is_ff = false; break;}
  }

  bool is_00 = true;
  for (int i=0; i<sizeof(buf_2D); i++) {
    if (buf_2D[i] != 0x00) {is_00 = false; break;}
  }

  if (is_00) {
    rval = EP_DEPG0150BN;
  }

  return rval;
}

#endif /* USE_EPAPER */

#if defined(USE_OLED)
bool nRF52_OLED_probe_func()
{
  Wire.begin();
  uint8_t addr = (nRF52_board == NRF52_SEEED_WIO_L1) ?
                 SH1106_OLED_I2C_ADDR_ALT : SSD1306_OLED_I2C_ADDR;
  Wire.beginTransmission(addr);
  return (Wire.endTransmission() == 0);
}
#endif /* USE_OLED */

