lyusupov/SoftRF/software/firmware/source/SoftRF/src/platform/nRF52.cpp
static byte nRF52_Display_setup()
{
  byte rval = DISPLAY_NONE;

  if (nRF52_board == NRF52_NORDIC_PCA10059 ||
      nRF52_board == NRF52_SEEED_T1000E    ||
      nRF52_board == NRF52_SEEED_X1        ||
      nRF52_board == NRF52_ELECROW_TN_M3   ||
      nRF52_board == NRF52_SEEED_T2000) {
      /* Nothing to do */
  } else if (nRF52_board == NRF52_SEEED_WIO_L1) {
#if defined(USE_OLED)
    u8x8_i2c.setI2CAddress(SH1106_OLED_I2C_ADDR_ALT << 1);
    rval = OLED_setup();
#endif /* USE_OLED */
  } else if (nRF52_board == NRF52_ELECROW_TN_M6     ||
             nRF52_board == NRF52_LILYGO_TECHO_CARD ||
             nRF52_board == NRF52_LILYGO_TIMPULSE_PLUS) {
#if defined(USE_OLED)
    rval = OLED_setup();
#endif /* USE_OLED */
  } else if (nRF52_board == NRF52_HELTEC_T114) {
#if defined(USE_TFT)
#if SPI_INTERFACES_COUNT == 1
    SPI1.setPins(SOC_GPIO_PIN_T114_TFT_MISO,
                 SOC_GPIO_PIN_T114_TFT_SCK,
                 SOC_GPIO_PIN_T114_TFT_MOSI);
#endif

    nRF52_display = TFT_LH114TIF03;

    tft = new TFT_eSPI(LV_HOR_RES, LV_VER_RES);
    tft->init();
#if LV_HOR_RES != 135 && LV_HOR_RES != 80
    uint8_t r = 0;
#else
    uint8_t r = 1; /* 90 degrees */
#endif /* LV_HOR_RES */
    tft->setRotation(r);
    tft->fillScreen(TFT_NAVY);

    int bl_pin = SOC_GPIO_PIN_T114_TFT_BLGT;

    tft->setTextFont(4);
    tft->setTextSize(2);
    tft->setTextColor(TFT_WHITE, TFT_NAVY);

    uint16_t tbw = tft->textWidth(SoftRF_text1);
    uint16_t tbh = tft->fontHeight();
    tft->setCursor((tft->width() - tbw)/2, (tft->height() - tbh)/2);
    tft->println(SoftRF_text1);

    for (int level = 0; level < 255; level += 25) {
      TFT_backlight_adjust(bl_pin, level);
      delay(100);
    }

#if LV_HOR_RES == 135
    rval = DISPLAY_TFT_TTGO_135;
#elif LV_HOR_RES == 80
    rval = DISPLAY_TFT_HELTEC_80;
#else
    rval = DISPLAY_TFT_TTGO_240;
#endif /* LV_HOR_RES */
#endif /* USE_TFT */
#if !defined(EXCLUDE_WIP)
  } else if (nRF52_board == NRF52_HELTEC_T1) {
#if defined(USE_TFT)
#if SPI_INTERFACES_COUNT == 1
    SPI1.setPins(SOC_GPIO_PIN_T1_TFT_MISO,
                 SOC_GPIO_PIN_T1_TFT_SCK,
                 SOC_GPIO_PIN_T1_TFT_MOSI);
#endif
    /* TODO */
#endif /* USE_TFT */
#endif /* EXCLUDE_WIP */
  } else {
#if defined(USE_EPAPER)

#if SPI_INTERFACES_COUNT >= 2
    switch (nRF52_board)
    {
      case NRF52_LILYGO_TECHO_REV_0:
      case NRF52_LILYGO_TECHO_REV_1:
      case NRF52_LILYGO_TECHO_REV_2:
      case NRF52_LILYGO_TECHO_PLUS:
      case NRF52_ELECROW_TN_M1:
      case NRF52_ELECROW_TN_M8:
      default:
        SPI1.setPins(SOC_GPIO_PIN_EPD_MISO,
                     SOC_GPIO_PIN_EPD_SCK,
                     SOC_GPIO_PIN_EPD_MOSI);
        break;
    }
#endif

    if (nRF52_display == EP_UNKNOWN) {
      nRF52_display = nRF52_EPD_ident();
    }

    switch (nRF52_display)
    {
    case EP_GDEP015OC1:
      display = new GxEPD2_BW<GxEPD2_154, GxEPD2_154::HEIGHT> (
                      GxEPD2_154(
                        SOC_GPIO_PIN_EPD_SS,
                        SOC_GPIO_PIN_EPD_DC,
                        SOC_GPIO_PIN_EPD_RST,
                        SOC_GPIO_PIN_EPD_BUSY));
      break;
    case EP_DEPG0150BN:
      display = new GxEPD2_BW<GxEPD2_150_BN, GxEPD2_150_BN::HEIGHT> (
                      GxEPD2_150_BN(
                        SOC_GPIO_PIN_EPD_SS,
                        SOC_GPIO_PIN_EPD_DC,
                        SOC_GPIO_PIN_EPD_RST,
                        SOC_GPIO_PIN_EPD_BUSY));
      break;
    case EP_GDEH0154D67:
    default:
      display = new GxEPD2_BW<GxEPD2_154_D67, GxEPD2_154_D67::HEIGHT> (
                      GxEPD2_154_D67(
                        SOC_GPIO_PIN_EPD_SS,
                        SOC_GPIO_PIN_EPD_DC,
                        SOC_GPIO_PIN_EPD_RST,
                        SOC_GPIO_PIN_EPD_BUSY));
      break;
    }

    display->epd2.selectSPI(SPI1, SPISettings(4000000, MSBFIRST, SPI_MODE0));

    if (EPD_setup(true)) {

#if defined(USE_EPD_TASK)
      Display_Semaphore = xSemaphoreCreateBinary();

      if( Display_Semaphore != NULL ) {
        xSemaphoreGive( Display_Semaphore );
      }

      xTaskCreate(EPD_Task, "EPD", EPD_STACK_SZ, NULL,
                  /* TASK_PRIO_HIGH */ TASK_PRIO_LOW , &EPD_Task_Handle);

      TaskInfoTime = millis();
#endif
      rval = DISPLAY_EPD_1_54;
    }

    /* EPD back light off */
    pinMode(SOC_GPIO_PIN_EPD_BLGT, OUTPUT);
    digitalWrite(SOC_GPIO_PIN_EPD_BLGT, nRF52_board == NRF52_ELECROW_TN_M1 ||
                                        nRF52_board == NRF52_ELECROW_TN_M8 ?
                                        HIGH : LOW);
#endif /* USE_EPAPER */
  }

  return rval;
}

static void nRF52_Display_loop()
{
  char buf[16];
  uint32_t disp_value;

  uint16_t tbw;
  uint16_t tbh;

  switch (hw_info.display)
  {
#if defined(USE_EPAPER)
  case DISPLAY_EPD_1_54:
    EPD_loop();

#if 0
    if (millis() - TaskInfoTime > 5000) {
      char pcWriteBuffer[512];
      vTaskList(pcWriteBuffer );
      Serial.println(pcWriteBuffer); Serial.flush();
      TaskInfoTime = millis();
    }
#endif
    break;
#endif /* USE_EPAPER */

#if defined(USE_TFT)
#if LV_HOR_RES == 135
  case DISPLAY_TFT_TTGO_135:
    if (tft) {
      if (!TFT_display_frontpage) {
        tft->fillScreen(TFT_NAVY);

        tft->setTextFont(2);
        tft->setTextSize(2);
        tft->setTextColor(TFT_WHITE, TFT_NAVY);

        tbw = tft->textWidth(ID_text);
        tbh = tft->fontHeight();

        tft->setCursor(tft->textWidth(" "), tft->height()/4 - tbh - 1);
        tft->print(ID_text);

        tbw = tft->textWidth(PROTOCOL_text);

        tft->setCursor(tft->width() - tbw - tft->textWidth(" "),
                       tft->height()/4 - tbh - 1);
        tft->print(PROTOCOL_text);

        tbw = tft->textWidth(RX_text);
        tbh = tft->fontHeight();

        tft->setCursor(tft->textWidth("   "), 3*tft->height()/4 - tbh - 1);
        tft->print(RX_text);

        tbw = tft->textWidth(TX_text);

        tft->setCursor(tft->width()/2 + tft->textWidth("   "),
                       3*tft->height()/4 - tbh - 1);
        tft->print(TX_text);

        tft->setTextFont(2);
        tft->setTextSize(3);

