lyusupov/SoftRF/software/firmware/source/SoftRF/src/platform/nRF52.cpp
        snprintf (buf, sizeof(buf), "%06X", ThisAircraft.addr);

        tbw = tft->textWidth(buf);
        tbh = tft->fontHeight();

        tft->setCursor(tft->textWidth(" "), tft->height()/4 - 7);
        tft->print(buf);

        tbw = tft->textWidth("O");

        tft->setCursor(tft->width() - tbw - tft->textWidth(" "),
                       tft->height()/4 - 7);
        tft->print(Protocol_ID[ThisAircraft.protocol][0]);

        itoa(rx_packets_counter % 1000, buf, 10);
        tft->setCursor(tft->textWidth(" "), 3*tft->height()/4 - 7);
        tft->print(buf);

        itoa(tx_packets_counter % 1000, buf, 10);
        tft->setCursor(tft->width()/2 + tft->textWidth(" "), 3*tft->height()/4 - 7);
        tft->print(buf);

        TFT_display_frontpage = true;

      } else { /* TFT_display_frontpage */

        if (rx_packets_counter > prev_rx_packets_counter) {
          disp_value = rx_packets_counter % 1000;
          itoa(disp_value, buf, 10);

          if (disp_value < 10) {
            strcat_P(buf,PSTR("   "));
          } else {
            if (disp_value < 100) {
              strcat_P(buf,PSTR(" "));
            };
          }

          tft->setTextFont(2);
          tft->setTextSize(3);

          tft->setCursor(tft->textWidth(" "), 3*tft->height()/4 - 7);
          tft->print(buf);

          prev_rx_packets_counter = rx_packets_counter;
        }
        if (tx_packets_counter > prev_tx_packets_counter) {
          disp_value = tx_packets_counter % 1000;
          itoa(disp_value, buf, 10);

          if (disp_value < 10) {
            strcat_P(buf,PSTR("   "));
          } else {
            if (disp_value < 100) {
              strcat_P(buf,PSTR(" "));
            };
          }

          tft->setTextFont(2);
          tft->setTextSize(3);

          tft->setCursor(tft->width()/2 + tft->textWidth(" "), 3*tft->height()/4 - 7);
          tft->print(buf);

          prev_tx_packets_counter = tx_packets_counter;
        }
      }
    }

    break;

#endif /* LV_HOR_RES == 135 */
#endif /* USE_TFT */

#if defined(USE_OLED)
#if !defined(EXCLUDE_OLED_049)
  case DISPLAY_OLED_0_49:
#endif /* EXCLUDE_OLED_049 */
  case DISPLAY_OLED_1_3:
  case DISPLAY_OLED_TTGO:
  case DISPLAY_OLED_HELTEC:
    OLED_loop();
    break;
#endif /* USE_OLED */

  case DISPLAY_NONE:
  default:
    break;
  }
}

static void nRF52_Display_fini(int reason)
{
  switch (hw_info.display)
  {
#if defined(USE_EPAPER)
  case DISPLAY_EPD_1_54:

    EPD_fini(reason, screen_saver);

#if defined(USE_EPD_TASK)
    if( EPD_Task_Handle != NULL )
    {
      vTaskDelete( EPD_Task_Handle );
    }

    if( Display_Semaphore != NULL )
    {
      vSemaphoreDelete( Display_Semaphore );
    }
#endif

    SPI1.end();

    // pinMode(SOC_GPIO_PIN_EPD_MISO, INPUT);
    // pinMode(SOC_GPIO_PIN_EPD_MOSI, INPUT);
    // pinMode(SOC_GPIO_PIN_EPD_SCK,  INPUT);
    pinMode(SOC_GPIO_PIN_EPD_SS,   INPUT);
    pinMode(SOC_GPIO_PIN_EPD_DC,   INPUT);
    pinMode(SOC_GPIO_PIN_EPD_RST,  INPUT);
    // pinMode(SOC_GPIO_PIN_EPD_BUSY, INPUT);
    pinMode(SOC_GPIO_PIN_EPD_BLGT, INPUT);

    break;
#endif /* USE_EPAPER */

#if defined(USE_TFT)
  case DISPLAY_TFT_TTGO_135:
    if (tft) {
        int level;
        const char *msg = (reason == SOFTRF_SHUTDOWN_LOWBAT) ?
                   "LOW BAT" : "  OFF  ";

        int bl_pin = SOC_GPIO_PIN_T114_TFT_BLGT;

        for (level = 250; level >= 0; level -= 25) {
          TFT_backlight_adjust(bl_pin, level);
          delay(100);
        }

        tft->fillScreen(TFT_NAVY);
        tft->setTextFont(4);
#if LV_VER_RES == 160
        if (reason == SOFTRF_SHUTDOWN_LOWBAT) {
          tft->setTextSize(1);
        } else
#endif
        {
          tft->setTextSize(2);
        }
        tft->setTextColor(TFT_WHITE, TFT_NAVY);

        uint16_t tbw = tft->textWidth(msg);
        uint16_t tbh = tft->fontHeight();

        tft->setCursor((tft->width() - tbw)/2, (tft->height() - tbh)/2);
        tft->print(msg);

        for (level = 0; level <= 250; level += 25) {
          TFT_backlight_adjust(bl_pin, level);
          delay(100);
        }

        delay(2000);

        for (level = 250; level >= 0; level -= 25) {
          TFT_backlight_adjust(bl_pin, level);
          delay(100);
        }

        TFT_backlight_adjust(bl_pin, 0);
        /* TODO: turn PWM off */
        pinMode(bl_pin, INPUT_PULLDOWN);

        tft->fillScreen(TFT_NAVY);
        TFT_off();
    }

    SPI1.end();

    // pinMode(SOC_GPIO_PIN_T114_TFT_MISO, INPUT);
    // pinMode(SOC_GPIO_PIN_T114_TFT_MOSI, INPUT);
    // pinMode(SOC_GPIO_PIN_T114_TFT_SCK,  INPUT);
    pinMode(SOC_GPIO_PIN_T114_TFT_SS,   INPUT);
    pinMode(SOC_GPIO_PIN_T114_TFT_DC,   INPUT);
    pinMode(SOC_GPIO_PIN_T114_TFT_RST,  INPUT);
    pinMode(SOC_GPIO_PIN_T114_TFT_BLGT, INPUT);

    break;
#endif /* USE_TFT */

#if defined(USE_OLED)
#if !defined(EXCLUDE_OLED_049)
  case DISPLAY_OLED_0_49:
#endif /* EXCLUDE_OLED_049 */
  case DISPLAY_OLED_1_3:
  case DISPLAY_OLED_TTGO:
  case DISPLAY_OLED_HELTEC:
    OLED_fini(reason);
    break;
#endif /* USE_OLED */

  case DISPLAY_NONE:
  default:
    break;
  }
}

#if !defined(ARDUINO_ARCH_MBED) && !defined(ARDUINO_ARCH_ZEPHYR)
static bool nRF52_Display_lock()
{
  bool rval = false;

  if ( Display_Semaphore != NULL ) {
    rval = (xSemaphoreTake( Display_Semaphore, ( TickType_t ) 0 ) == pdTRUE);
  }
//Serial.print("Display_lock: "); Serial.println(rval); Serial.flush();
  return rval;
}

static bool nRF52_Display_unlock()
{
  bool rval = false;

  if ( Display_Semaphore != NULL ) {
    rval = (xSemaphoreGive( Display_Semaphore ) == pdTRUE);
  }
//Serial.print("Display_unlock: "); Serial.println(rval); Serial.flush();
  return rval;
}
#endif /* ARDUINO_ARCH_MBED */

static void nRF52_Battery_setup()
{

