lyusupov/SoftRF/software/firmware/source/SoftRF/src/platform/nRF52.cpp
}

static float nRF52_Battery_param(uint8_t param)
{
  uint32_t bat_adc_pin;
  float rval, voltage, mult;

  switch (param)
  {
  case BATTERY_PARAM_THRESHOLD:
    rval = hw_info.model == SOFTRF_MODEL_BADGE    ? BATTERY_THRESHOLD_LIPO   :
           hw_info.model == SOFTRF_MODEL_NEO      ? BATTERY_THRESHOLD_LIPO   :
           hw_info.model == SOFTRF_MODEL_CARD     ? BATTERY_THRESHOLD_LIPO   :
           hw_info.model == SOFTRF_MODEL_COZY     ? BATTERY_THRESHOLD_LIPO   :
           hw_info.model == SOFTRF_MODEL_HANDHELD ? BATTERY_THRESHOLD_LIPO   :
           hw_info.model == SOFTRF_MODEL_DECENT   ? BATTERY_THRESHOLD_LIPO   :
           hw_info.model == SOFTRF_MODEL_SOLARIS  ? BATTERY_THRESHOLD_LIPO   :
           hw_info.model == SOFTRF_MODEL_POCKET   ? BATTERY_THRESHOLD_LIPO   :
           hw_info.model == SOFTRF_MODEL_RUGGED   ? BATTERY_THRESHOLD_LIPO   :
           hw_info.model == SOFTRF_MODEL_CARD_MK2 ? BATTERY_THRESHOLD_LIPO   :
           hw_info.model == SOFTRF_MODEL_CARD_MK3 ? BATTERY_THRESHOLD_LIPO   :
           hw_info.model == SOFTRF_MODEL_STYLUS   ? BATTERY_THRESHOLD_LIPO   :
                                                    BATTERY_THRESHOLD_NIMHX2;
    break;

  case BATTERY_PARAM_CUTOFF:
    rval = hw_info.model == SOFTRF_MODEL_BADGE    ? BATTERY_CUTOFF_LIPO   :
           hw_info.model == SOFTRF_MODEL_NEO      ? BATTERY_CUTOFF_LIPO   :
           hw_info.model == SOFTRF_MODEL_CARD     ? BATTERY_CUTOFF_LIPO   :
           hw_info.model == SOFTRF_MODEL_COZY     ? BATTERY_CUTOFF_LIPO   :
           hw_info.model == SOFTRF_MODEL_HANDHELD ? BATTERY_CUTOFF_LIPO   :
           hw_info.model == SOFTRF_MODEL_DECENT   ? BATTERY_CUTOFF_LIPO   :
           hw_info.model == SOFTRF_MODEL_SOLARIS  ? BATTERY_CUTOFF_LIPO   :
           hw_info.model == SOFTRF_MODEL_POCKET   ? BATTERY_CUTOFF_LIPO   :
           hw_info.model == SOFTRF_MODEL_RUGGED   ? BATTERY_CUTOFF_LIPO   :
           hw_info.model == SOFTRF_MODEL_CARD_MK2 ? BATTERY_CUTOFF_LIPO   :
           hw_info.model == SOFTRF_MODEL_CARD_MK3 ? BATTERY_CUTOFF_LIPO   :
           hw_info.model == SOFTRF_MODEL_STYLUS   ? BATTERY_CUTOFF_LIPO   :
                                                    BATTERY_CUTOFF_NIMHX2;
    break;

  case BATTERY_PARAM_CHARGE:
    voltage = Battery_voltage();
    if (voltage < Battery_cutoff())
      return 0;

    if (voltage > 4.2)
      return 100;

    if (voltage < 3.6) {
      voltage -= 3.3;
      return (voltage * 100) / 3;
    }

    voltage -= 3.6;
    rval = 10 + (voltage * 150 );
    break;

  case BATTERY_PARAM_VOLTAGE:
  default:
    voltage = 0.0;

    switch (hw_info.pmu)
    {
    case PMU_NONE:
    default:
      // Set the analog reference to 3.0V (default = 3.6V)
#if !defined(ARDUINO_ARCH_MBED) && !defined(ARDUINO_ARCH_ZEPHYR)
      analogReference(AR_INTERNAL_3_0);
#endif /* ARDUINO_ARCH_MBED */

      // Set the resolution to 12-bit (0..4095)
#if !defined(ARDUINO_ARCH_ZEPHYR)
      analogReadResolution(12); // Can be 8, 10, 12 or 14
#endif /* AARDUINO_ARCH_ZEPHYR */

      // Let the ADC settle
      delay(1);

      switch (nRF52_board)
      {
        case NRF52_SEEED_T1000E:
        case NRF52_SEEED_X1:
          bat_adc_pin = SOC_GPIO_PIN_T1000_BATTERY;
          mult        = SOC_ADC_T1000_VOLTAGE_DIV;
          break;
        case NRF52_HELTEC_T114:
          bat_adc_pin = SOC_GPIO_PIN_T114_BATTERY;
          mult        = SOC_ADC_T114_VOLTAGE_DIV;
          break;
        case NRF52_ELECROW_TN_M1:
          bat_adc_pin = SOC_GPIO_PIN_M1_BATTERY;
          mult        = SOC_ADC_VOLTAGE_DIV;
          break;
        case NRF52_ELECROW_TN_M3:
          bat_adc_pin = SOC_GPIO_PIN_M3_BATTERY;
          mult        = SOC_ADC_M3_VOLTAGE_DIV;
          break;
        case NRF52_ELECROW_TN_M6:
          bat_adc_pin = SOC_GPIO_PIN_M6_BATTERY;
          mult        = SOC_ADC_M6_VOLTAGE_DIV;
          break;
        case NRF52_ELECROW_TN_M8:
          bat_adc_pin = SOC_GPIO_PIN_M8_BATTERY;
          mult        = SOC_ADC_M8_VOLTAGE_DIV;
          break;
        case NRF52_SEEED_WIO_L1:
          bat_adc_pin = SOC_GPIO_PIN_L1_BATTERY;
          mult        = SOC_ADC_VOLTAGE_DIV;
          break;
        case NRF52_SEEED_T2000:
          bat_adc_pin = SOC_GPIO_PIN_T2000_BATTERY;
          mult        = SOC_ADC_T2000_VOLTAGE_DIV;
          break;
        case NRF52_LILYGO_TIMPULSE_PLUS:
          bat_adc_pin = SOC_GPIO_PIN_TIP_BATTERY;
          mult        = SOC_ADC_VOLTAGE_DIV;
          break;
        case NRF52_LILYGO_TECHO_CARD:
          bat_adc_pin = SOC_GPIO_PIN_TEC_BATTERY;
          mult        = SOC_ADC_VOLTAGE_DIV;
          break;
        case NRF52_LILYGO_TECHO_REV_0:
        case NRF52_LILYGO_TECHO_REV_1:
        case NRF52_LILYGO_TECHO_REV_2:
        case NRF52_LILYGO_TECHO_PLUS:
        case NRF52_NORDIC_PCA10059:
        default:
          bat_adc_pin = SOC_GPIO_PIN_BATTERY;
          mult        = SOC_ADC_VOLTAGE_DIV;
          break;
      }

      // Get the raw 12-bit, 0..3000mV ADC value
      voltage = analogRead(bat_adc_pin);

      // Set the ADC back to the default settings
#if !defined(ARDUINO_ARCH_MBED) && !defined(ARDUINO_ARCH_ZEPHYR)
      analogReference(AR_DEFAULT);
#endif /* ARDUINO_ARCH_MBED */
#if !defined(ARDUINO_ARCH_ZEPHYR)
      analogReadResolution(10);
#endif /* AARDUINO_ARCH_ZEPHYR */

      // Convert the raw value to compensated mv, taking the resistor-
      // divider into account (providing the actual LIPO voltage)
      // ADC range is 0..3000mV and resolution is 12-bit (0..4095)
      voltage *= (mult * VBAT_MV_PER_LSB);

      break;
    }

    rval = voltage * 0.001;
    break;
  }

  return rval;
}

void nRF52_GNSS_PPS_Interrupt_handler() {
  PPS_TimeMarker = millis();
}

static unsigned long nRF52_get_PPS_TimeMarker() {
  return PPS_TimeMarker;
}

static bool nRF52_Baro_setup() {
  return nRF52_board == NRF52_SEEED_T1000E ||
         nRF52_board == NRF52_SEEED_X1     ||
         nRF52_board == NRF52_ELECROW_TN_M3 ?
         false : true;
}

static void nRF52_UATSerial_begin(unsigned long baud)
{

