lyusupov/SoftRF/software/firmware/source/SoftRF/src/platform/nRF52.cpp
}

static void nRF52_UATModule_restart()
{

}

static void nRF52_WDT_setup()
{
#if !defined(ARDUINO_ARCH_MBED) && !defined(ARDUINO_ARCH_ZEPHYR)
  Watchdog.enable(12000);
#endif /* ARDUINO_ARCH_MBED */
}

static void nRF52_WDT_fini()
{
#if !defined(ARDUINO_ARCH_MBED) && !defined(ARDUINO_ARCH_ZEPHYR)
  // cannot disable nRF's WDT
  if (nrf_wdt_started(NRF_WDT)) {
    Watchdog.reset();
  }
#endif /* ARDUINO_ARCH_MBED */
}

#include <AceButton.h>
using namespace ace_button;

AceButton button_1(SOC_GPIO_PIN_BUTTON);
AceButton button_2(SOC_GPIO_PIN_PAD);

// The event handler for the button.
void handleEvent(AceButton* button, uint8_t eventType, uint8_t buttonState) {

  switch (eventType) {
    case AceButton::kEventClicked:
    case AceButton::kEventReleased:
#if defined(USE_EPAPER)
      if (button == &button_1) {
#if 0
        if (eventType == AceButton::kEventClicked) {
          Serial.println(F("kEventClicked."));
        } else if (eventType == AceButton::kEventReleased) {
          Serial.println(F("kEventReleased."));
        }
#endif
        EPD_Mode();
      } else if (button == &button_2) {
        EPD_Up();
      }
#endif /* USE_EPAPER */
#if defined(USE_OLED)
      if (button == &button_1 &&
         (hw_info.display == DISPLAY_OLED_1_3  ||
#if !defined(EXCLUDE_OLED_049)
          hw_info.display == DISPLAY_OLED_0_49 ||
#endif /* EXCLUDE_OLED_049 */
          hw_info.display == DISPLAY_OLED_TTGO)) {
        OLED_Next_Page();
      }
#endif /* USE_OLED */
      break;
    case AceButton::kEventDoubleClicked:
#if defined(USE_EPAPER)
      if (button == &button_1) {
//        Serial.println(F("kEventDoubleClicked."));
        digitalWrite(SOC_GPIO_PIN_EPD_BLGT,
                     digitalRead(SOC_GPIO_PIN_EPD_BLGT) == LOW);
      }
#endif
      break;
    case AceButton::kEventLongPressed:
      if (button == &button_1) {

#if defined(USE_EPAPER)
        int up_button_pin = -1;

        switch (nRF52_board)
        {
          case NRF52_ELECROW_TN_M1:
            up_button_pin = SOC_GPIO_PIN_M1_BUTTON2;
            break;

          case NRF52_LILYGO_TECHO_REV_0:
          case NRF52_LILYGO_TECHO_REV_1:
          case NRF52_LILYGO_TECHO_REV_2:
          case NRF52_LILYGO_TECHO_PLUS:
          case NRF52_NORDIC_PCA10059:
            up_button_pin = SOC_GPIO_PIN_PAD;
          default:
            break;
        }

        if (up_button_pin >= 0 && digitalRead(up_button_pin) == LOW) {
          screen_saver = true;
        }
#endif

        shutdown(SOFTRF_SHUTDOWN_BUTTON);
        Serial.println(F("This will never be printed."));
      }
      break;
  }
}

/* Callbacks for push button interrupt */
void onModeButtonEvent() {
  button_1.check();
}

/* Callbacks for touch button interrupt */
void onUpButtonEvent() {
  button_2.check();
}

static void nRF52_Button_setup()
{
  int mode_button_pin;
  int up_button_pin = -1;

  switch (nRF52_board)
  {
#if !defined(EXCLUDE_WIP)
    case NRF52_SEEED_WIO_L1:
      mode_button_pin = SOC_GPIO_PIN_L1_BUTTON;
      break;

    case NRF52_SEEED_T2000:
      mode_button_pin = SOC_GPIO_PIN_T2000_BUTTON;
      break;

    case NRF52_HELTEC_T1:
      mode_button_pin = SOC_GPIO_PIN_T1_BUTTON1;
      // up_button_pin   = SOC_GPIO_PIN_T1_BUTTON2;
      break;
#endif /* EXCLUDE_WIP */

    case NRF52_SEEED_T1000E:
    case NRF52_SEEED_X1:
      mode_button_pin = SOC_GPIO_PIN_T1000_BUTTON;
      break;

    case NRF52_HELTEC_T114:
      mode_button_pin = SOC_GPIO_PIN_T114_BUTTON;
      break;

    case NRF52_ELECROW_TN_M1:
      mode_button_pin = SOC_GPIO_PIN_M1_BUTTON1;
      up_button_pin   = SOC_GPIO_PIN_M1_BUTTON2;
      break;

    case NRF52_ELECROW_TN_M3:
      mode_button_pin = SOC_GPIO_PIN_M3_BUTTON;
      break;

    case NRF52_ELECROW_TN_M6:
      mode_button_pin = SOC_GPIO_PIN_M6_BUTTON;
      break;

    case NRF52_ELECROW_TN_M8:
      mode_button_pin = SOC_GPIO_PIN_M8_ENC_BTN;
      break;

    case NRF52_LILYGO_TIMPULSE_PLUS:
      mode_button_pin = SOC_GPIO_PIN_TIP_PAD;
      break;

    case NRF52_LILYGO_TECHO_CARD:
      mode_button_pin = SOC_GPIO_PIN_TEC_BUTTON;
      break;

    case NRF52_LILYGO_TECHO_REV_0:
    case NRF52_LILYGO_TECHO_REV_1:
    case NRF52_LILYGO_TECHO_REV_2:
    case NRF52_LILYGO_TECHO_PLUS:
    case NRF52_NORDIC_PCA10059:
      up_button_pin   = SOC_GPIO_PIN_PAD;
    default:
      mode_button_pin = SOC_GPIO_PIN_BUTTON;
      break;
  }

  // Button(s) uses external pull up resistor.
  pinMode(mode_button_pin, nRF52_board == NRF52_LILYGO_TECHO_REV_1 ? INPUT_PULLUP   :
                           nRF52_board == NRF52_SEEED_T1000E       ? INPUT_PULLDOWN :
                           nRF52_board == NRF52_SEEED_X1           ? INPUT_PULLDOWN :
                           nRF52_board == NRF52_ELECROW_TN_M6      ? INPUT_PULLUP   :
                           INPUT);
  if (up_button_pin >= 0) { pinMode(up_button_pin, INPUT); }

  button_1.init(mode_button_pin, nRF52_board == NRF52_SEEED_T1000E ||
                                 nRF52_board == NRF52_SEEED_X1     ?
                                 LOW : HIGH);
  if (up_button_pin >= 0) { button_2.init(up_button_pin); }

  // Configure the ButtonConfig with the event handler, and enable all higher
  // level events.
  ButtonConfig* ModeButtonConfig = button_1.getButtonConfig();
  ModeButtonConfig->setEventHandler(handleEvent);
  ModeButtonConfig->setFeature(ButtonConfig::kFeatureDoubleClick);
  ModeButtonConfig->setFeature(ButtonConfig::kFeatureLongPress);
  ModeButtonConfig->setFeature(ButtonConfig::kFeatureSuppressAfterClick);
  ModeButtonConfig->setFeature(ButtonConfig::kFeatureSuppressAfterDoubleClick);
  ModeButtonConfig->setFeature(
                    ButtonConfig::kFeatureSuppressClickBeforeDoubleClick);
//  ModeButtonConfig->setDebounceDelay(15);
  ModeButtonConfig->setClickDelay(600);
  ModeButtonConfig->setDoubleClickDelay(1500);
  ModeButtonConfig->setLongPressDelay(2000);

  ButtonConfig* UpButtonConfig = button_2.getButtonConfig();
  UpButtonConfig->setEventHandler(handleEvent);
  UpButtonConfig->setFeature(ButtonConfig::kFeatureClick);
//  UpButtonConfig->setDebounceDelay(15);
  UpButtonConfig->setClickDelay(600);
  UpButtonConfig->setDoubleClickDelay(1500);
  UpButtonConfig->setLongPressDelay(2000);

